{
  "category_name": "Kids & Toys",
  "products": [
    {
      "id": "soft_baby_sleeping_p_mh4lwg3e_br8seg",
      "name": "Soft Baby Sleeping Pillow With Neck Support | Comfortable Newborn Pillow For Head & Neck Protection | Printed Baby Sleep Cushion",
      "category": "Kids & Toys",
      "subcategory": "Baby_Care",
      "price": 649,
      "original_price": null,
      "description": "Description\r\nSoft Baby Sleeping Pillow With Neck Support | Comfortable Newborn Pillow For Head & Neck Protection | Printed Baby Sleep Cushion\r\n\r\nThe Soft Baby Sleeping Pillow Is Perfectly Designed To Provide Maximum Comfort And Safety For Your Baby. Made From High-Quality Fabric, This Pillow Ensures Gentle Support For Your Baby?s Head And Neck, Reducing The Risk Of Flat Head Syndrome. Its Unique Shape Keeps The Baby?s Spine And Posture Aligned While Sleeping. The Soft Filling Offers Plush Comfort, And The Beautiful Printed Fabric Adds A Cute Touch To Your Baby?s Bedding. Ideal For Newborns And Infants, This Pillow Ensures A Cozy, Safe, And Restful Sleep Experience.\r\n\r\nKey Features:\r\n\r\nMade With Soft And Breathable FabricProvides Head And Neck Support For BabiesHelps Prevent Flat Head SyndromeLightweight, Washable, And Easy To CarryAttractive Printed Design For BabiesSuitable For Newborns And InfantsPerfect For Cribs, Beds, And Travel Use",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.314Z",
      "updated_at": "2025-10-24T08:46:00.314Z"
    },
    {
      "id": "newborn_baby_wrap_bl_mh4lwg4e_vjrgeu",
      "name": "Newborn Baby Wrap Blankets Soft And Breathable Swaddle | Comfortable Sleeping Blanket For 0-1 Year Babies | Random Color",
      "category": "Kids & Toys",
      "subcategory": "Baby_Care",
      "price": 849,
      "original_price": null,
      "description": "Description\r\nNewborn Baby Wrap Blankets Soft And Breathable Swaddle | Comfortable Sleeping Blanket For 0-1 Year Babies | Random Color\r\n\r\nThis Newborn Baby Wrap Blanket Is Designed To Keep Your Baby Comfortable And Secure In Every Season. Made From Soft, Breathable Fabric, It Provides Gentle Warmth Without Causing Overheating. Ideal For Babies Aged 0-1 Year, This Blanket Is Perfect For Sleeping, Swaddling, Or Outdoor Use. Its Lightweight Material Ensures A Cozy Yet Airy Feel, Making It Suitable For Daily Use. Available In Random Colors, Each Wrap Combines Comfort And Style For Your Little One?s Peaceful Sleep.\r\n\r\nKey Features:\r\n\r\nSoft And Breathable Fabric For Daily ComfortPerfect For Babies Aged 0-1 YearLightweight And Gentle On Baby?s SkinProvides Comfort, Warmth, And SecurityCan Be Used For Sleeping, Swaddling, Or TravelAvailable In Random Beautiful ColorsEasy To Wash And Quick To Dry",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.350Z",
      "updated_at": "2025-10-24T08:46:00.350Z"
    },
    {
      "id": "inflatable_water_pla_mh4lwg52_ezxxu3",
      "name": "Inflatable Water Play Mat ? Premium Baby Toy For Infants & Toddlers, Muscle Strengthening & Sensory Development",
      "category": "Kids & Toys",
      "subcategory": "Toys",
      "price": 699,
      "original_price": null,
      "description": "Description\r\nInflatable Water Play Mat ? Premium Baby Toy For Infants & Toddlers, Muscle Strengthening & Sensory Development\r\n\r\nImaginative Underwater Design: Delightful scenes featuring vibrant marine creatures for immersive play.\r\n\r\nEncourages Healthy Development: Supports tummy time, aiding in the strengthening of neck and shoulder muscles.Encourages Healthy Development: Supports tummy time, aiding in the strengthening of neck and shoulder muscles.\r\n\r\nSafety First: Crafted from premium, non-toxic materials for a safe and worry-free play experience.\r\n\r\nEffortless Setup and Maintenance: Easy to inflate, fill, and clean, ensuring convenience for busy parents.\r\n\r\nOn-the-Go Entertainment: Lightweight and portable, perfect for playtime at home or while traveling.\r\n\r\nCognitive Exploration: Promotes curiosity and cognitive skills through interactive play and discovery.\r\n\r\nVersatile Play: Suitable for indoor and outdoor use, offering entertainment in various environments.\r\n\r\nIdeal Gift: A thoughtful and practical present for new parents, adding joy to their little one's early years.\r\n\r\nEngage and entertain your baby with the Infinno Inflatable Tummy Time Mat. Designed to strengthen muscles, improve motor skills, and provide sensory fun.\r\n\r\nThe Infinno Inflatable Tummy Time Water Play Mat is a premium developmental toy for infants and toddlers aged 3 to 24 months. Measuring 27.4 x 21.5 x 2.2 inches, this safe and durable play mat provides a fun, interactive way for babies to strengthen their neck, shoulder, and arm muscles while developing motor skills. Filled with water and floating shapes, it captures your baby?s attention, stimulates hand-eye coordination, and enhances sensory exploration. Portable and easy to set up, it?s perfect for home or travel use, making tummy time more enjoyable and beneficial for your little one.\r\n\r\nKey Features:\r\n\r\nPremium inflatable tummy time water play mat for infants and toddlersStrengthens neck, shoulder, and arm musclesEncourages motor s",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.374Z",
      "updated_at": "2025-10-24T08:46:00.374Z"
    },
    {
      "id": "36___8_hole_bazooka__mh4lwgiy_bpnmvy",
      "name": "36 / 8 hole bazooka bubble Water gun | Bazooka Water Bubble Gun Toy for Kids, toddlers | Out door Fun Water Spray Gun (Random color)",
      "category": "Kids & Toys",
      "subcategory": "Toys",
      "price": 920,
      "original_price": null,
      "description": "This Bazooka Bubble Gun Toy is the perfect way to add some fun to playtime! With its bubble-blowing feature, your child can create endless bubbles for hours of entertainment. The lightweight design makes it easy for little hands to handle. Let your child's imagination run wild with this exciting toy!\r\n?High Quality Materials] The Bubble Machine made of high-quality non-toxic and skin safe ABS plastic is selected in the material, which is 100% safe and durable, burr free, BPA and lead free. Passed the US toy standard CPSIA & ASTM test. No harm to toddlers, children, pets and adults. ?Popular Rocket Boom Bubble Machine?: Our bubble blower has been tested and adjusted many times by toy engineers. Ergonomic non-slip grips are used in the structure, suitable for hands of all ages. It?s a perfect prop for a photo, you can take perfect photos and videos with it. ?Most Popular Bubble Toys?: This Bubble Maker is a perfect gift for kids & friends, suitable for various party occasions, such as birthday parties, wedding, graduation, camping trips, beaches, backyard bubble parties, etc. ?Warm Tips? 1)Please use a special bubble solution not DIY soap, the former can create a lot of bubbles, it?s very important because with soap is not the same effect. 2) Please charged at least 2-3 hours to full before use. 3) Don?t stick too much bubble solution, it avoids bubbles sticking together, just only stick little solutions, it can blow thousands of bubble from machine outlet.Elevate bubble-blasting fun with the Bubble Rechargeable Machine Blaster Gun, featuring 36 holes and captivating lights for an enchanting experience.With its rechargeable design, this gun ensures long-lasting entertainment without the hassle of batteries.Material: PlasticBattery operated (4 AA Batteries) - (Not Included in the package)",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.874Z",
      "updated_at": "2025-10-24T08:46:00.874Z"
    },
    {
      "id": "small_duck_climbing__mh4lwgj4_jlqv0e",
      "name": "Small Duck Climbing Stairs Toy DIY Racing Track Toy Music Duck Roller Coaster(random color)",
      "category": "Kids & Toys",
      "subcategory": "Toys",
      "price": 1499,
      "original_price": null,
      "description": "Description: Item name: Electric Duck Climbing Stairs Toy Battery: 2 x AA batteries (not included) Number of ducks: 7pcs Recommended age: 3 years old or above\r\n\r\nweight ; 264 grams\r\nPackage Included: 1 Set Electric Duck Climbing Stairs Toy\r\n\r\nFeatures: 1. Safe Material: Made of ABS, the toy is non-toxic, eco-friendly, safe and durable. All parts are round and smooth without any sharp edge, which is safe for children. 2. Easy to Install and Carry: It is not large and can be taken anywhere after disassembly. It can be taken indoors, to gardens, beaches and queues. After being assembled in order, kids can start playing. 3. Unique Design: The toy set comes with flashing LED lights, and it is easy to assemble. The cute little yellow ducks can climb stairs and slide tracks. The toy contains interesting tracks and cheerful music (with on/off button). 4. Promote Baby's Development: Interesting songs and cheerful music can develop babies? visual perception, to help them recognize colors and help young children develop hand-eye coordination. 5. Perfect Gift: This is the perfect gift for the beginning of school season, Halloween, birthday or Christmas for kids.",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.880Z",
      "updated_at": "2025-10-24T08:46:00.880Z"
    },
    {
      "id": "hover_ball_with_ligh_mh4lwgjb_9jg8r5",
      "name": "Hover Ball with Lights Air Floating Soccer Toy with LED Lights and Foam Bumper, Indoor Games for Kids",
      "category": "Kids & Toys",
      "subcategory": "Toys",
      "price": 1190,
      "original_price": null,
      "description": "Hello kids !! I am a hover ball toy . Let me explain you how to play with me . As you insert AA batteries there will be vaccume pressure from downwards and when you put it on the ground it floats . Kick the hover ball and it will come back after getting hitted by wall or person.\r\nThis hover football can be used in outdoor gardens, parks, open spaces or indoor floors, thin carpets, or basements. In addition, the lighter weight helps the floating ball float better in the air and can effectively avoid obstacles on the ground Super Soft Bumper: This float football has super soft foam bumpers that can protect your furniture and walls from scratches and also protects the child?s feet from injury Colorful LED Lights: This hover football has beautiful multi-color LED lights, which can greatly attract children's attention and make night games more cool Convenient Sports: This hover football toy allows your child to kill time in inclement weather. Have fun even indoors! Circling football can make children exercise fully, allowing them to enjoy sports anytime, anywhere. This is more conducive to training children's brain response ability and hand-foot coordination Perfect Gift: This hover football is very suitable as a birthday holiday gift for children aged 3-12. Whether it is parent-child interaction or children playing independently, it can bring a lot of fun",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:00.887Z",
      "updated_at": "2025-10-24T08:46:00.887Z"
    },
    {
      "id": "hanging_ping_pong_ga_mh4lwgn0_qhggr6",
      "name": "Hanging Ping Pong Game Set ? Table Tennis Self Training Kit with 2 Rackets & Practice Ball, Parent-Child Interactive Kids Sports Toy (Random Color)",
      "category": "Kids & Toys",
      "subcategory": "Toys",
      "price": 920,
      "original_price": null,
      "description": "Hanging Ping Pong Game Set ? Table Tennis Self Training Kit with 2 Rackets & Practice Ball, Parent-Child Interactive Kids Sports Toy (Random Color)\r\n\r\nMake playtime fun and engaging with the Hanging Ping Pong Game Set, designed for kids and family interaction. This self-training table tennis kit includes 2 rackets and a practice ball attached for easy play, helping children improve coordination, focus, and reflexes. Perfect for indoor and outdoor use, it provides an exciting way for parents and kids to bond while staying active. Lightweight and portable, this sports toy is a great addition to family fun, parties, or everyday exercise.\r\n\r\nKey Features:\r\n\r\nProduct Type: Hanging Ping Pong / Table Tennis Training SetIncludes: 2 rackets & 1 practice ballFunction: Improves coordination, focus, and reflexesDesign: Parent-child interactive sports toyUsage: Suitable for indoor and outdoor playBenefit: Fun, safe, and engaging physical activity for kidsPortability: Lightweight and easy to set upPackage Includes: 1 Hanging Ping Pong Game Set (2 rackets + 1 ball",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:01.020Z",
      "updated_at": "2025-10-24T08:46:01.020Z"
    },
    {
      "id": "soft_head_shaping_ne_mh4lwgoh_2r3t76",
      "name": "Soft Head Shaping Newborn Pillow for Flat Head Prevention, Breathable & Portable Infant Cushion - Baby Head Shaping Pillow - Adjustable Newborn Baby Head Shaping Pillow ( Random Color & Design ) - Without Box",
      "category": "Kids & Toys",
      "subcategory": "Baby_Care",
      "price": 540,
      "original_price": null,
      "description": "Soft Head Shaping Newborn Pillow for Flat Head Prevention, Breathable & Portable Infant Cushion - Baby Head Shaping Pillow - Adjustable Newborn Baby Head Shaping Pillow ( Random Color & Design ) - Without Box\r\n? Prevents flat head syndrome in newborns? Soft, breathable, and skin-friendly fabric? Suitable for crib, stroller, bed, car seat, and travel use? Lightweight and portable ? perfect for on-the-go? Helps maintain proper sleeping posture? Easy to clean and reusable",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:46:01.073Z",
      "updated_at": "2025-10-24T08:46:01.073Z"
    }
  ]
}