{
  "category_name": "Sports & Outdoors",
  "products": [
    {
      "id": "tumbler_3pcs_bottle__mh4lkspj_fxgvi1",
      "name": "Tumbler 3pcs bottle set with straw",
      "category": "Sports & Outdoors",
      "subcategory": "Outdoor_Gear",
      "price": 2300,
      "original_price": null,
      "description": "1. Introducing our premium Tumbler 3-Piece Bottle Set with Straw, designed for those who appreciate both functionality and style in their beverage containers. Each tumbler in this set is crafted from high-quality, BPA-free plastic, ensuring that your drinks remain safe and free from harmful chemicals. The sleek design features a double-wall construction that not only keeps your beverages at the desired temperature for longer periods but also prevents condensation from forming on the exterior, keeping your hands and surfaces dry. With a generous capacity, these tumblers are perfect for a variety of drinks, including iced coffee, smoothies, and refreshing water infusions.\r\n\r\n2. The Tumbler 3-Piece Bottle Set comes equipped with reusable straws, promoting an eco-friendly lifestyle while enhancing your drinking experience. Each straw is made from durable, food-grade silicone, providing a soft yet sturdy option for sipping your favorite beverages. The set includes three vibrant colors, allowing you to easily identify your tumbler at gatherings or family outings. The straws are also designed to fit snugly into the tumblers, ensuring that you can enjoy your drinks without any spills or leaks. Additionally, the tumblers feature a secure, screw-on lid that prevents accidental openings, making them ideal for travel or outdoor activities.\r\n\r\n3. This versatile tumbler set is not only practical but also aesthetically pleasing, making it a perfect addition to your kitchen or a thoughtful gift for friends and family. The lightweight design allows for easy portability, whether you are heading to the gym, office, or a picnic in the park. Cleaning is a breeze, as the tumblers and straws are dishwasher safe, ensuring that you can maintain their pristine condition with minimal effort. Elevate your hydration game with our Tumbler 3-Piece Bottle Set with Straw, where convenience meets style, making every sip a delightful experience.",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:56.791Z",
      "updated_at": "2025-10-24T08:36:56.791Z"
    },
    {
      "id": "extended_type_finger_mh4lksq3_1hk000",
      "name": "Extended Type Fingerboard for gym",
      "category": "Sports & Outdoors",
      "subcategory": "Fitness_Equipment",
      "price": 749,
      "original_price": null,
      "description": "Condition: Prevent finger flexion convulsion, deformation and deporty Control the increase of muscle tension and big fish muscle atrophy Fingers ion prevention, finger joint deformation scar contracture Use 30-50 minutes  each . Suite for people \r\n\r\n:A: Brain injury, cerebral palsy, paraplegia, cerebral infarction sequela, all kinds of craniocerebral surgery and Parkinson's disease and peripral neuropathy ca by hand function disorder. \r\nB: Muscle tension, limb abnormal tension and brain injury patients\r\n Material: plastic \r\nHand: Both hands(Left or right hand) \r\ncolor: White \r\nPackage includes:1 x adult Finger board extension",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:56.811Z",
      "updated_at": "2025-10-24T08:36:56.811Z"
    },
    {
      "id": "500ml_insulated_vacu_mh4lksyw_wdbowb",
      "name": "500ml Insulated Vacuum Bottle ? Leakproof, Stainless Steel Travel Flask (Random Color)",
      "category": "Sports & Outdoors",
      "subcategory": "Outdoor_Gear",
      "price": 1400,
      "original_price": null,
      "description": "Elevate your hydration game with our premium 500ml Vacuum Bottle?designed for performance, style, and convenience. Crafted from high-quality stainless steel, this double-wall insulated bottle maintains your drink?s temperature for hours, whether you?re sipping hot coffee on a chilly morning or enjoying a cold beverage under the sun.\r\n\r\nIts sleek cylindrical design and metallic lid with a loop handle make it easy to carry and visually appealing. The leakproof seal ensures mess-free transport, while the BPA-free construction guarantees safe drinking. Available in a range of modern colors including green, dark gray, blue, black, and silver, this bottle complements any lifestyle?from office desks to hiking trails.\r\n\r\nWhether you're commuting, working out, or traveling, this vacuum bottle is your reliable companion for hydration on the go.\r\n\r\nPackage Includes : 1 x bottle and 2 x cups (Random Colors)",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:57.128Z",
      "updated_at": "2025-10-24T08:36:57.128Z"
    },
    {
      "id": "twister_plate_exerci_mh4lkt0p_t9vfg3",
      "name": "Twister Plate Exercise Gear Plastic Waist Twist Disc Board ? 360? Fitness Balance Trainer For Slimming, Core Strength, And Home Workout",
      "category": "Sports & Outdoors",
      "subcategory": "Fitness_Equipment",
      "price": 789,
      "original_price": null,
      "description": "Description\r\nTwister Plate Exercise Gear Plastic Waist Twist Disc Board ? 360? Fitness Balance Trainer For Slimming, Core Strength, And Home Workout\r\n\r\nAchieve A Slimmer And Stronger Body With The Twister Plate Exercise Gear Plastic Waist Twist Disc Board. Designed For Effective Home Workouts, This 360? Rotating Balance Board Helps Tone Your Waist, Strengthen Core Muscles, And Improve Body Balance. Made From Durable Plastic Material, It Provides Smooth Twisting Motion And Non-Slip Stability During Exercise. Perfect For Daily Fitness Routines, Yoga, Or Weight Loss Programs, This Compact And Portable Twister Disc Is Ideal For Burning Calories And Enhancing Flexibility. Suitable For Both Men And Women, It?s A Fun And Easy Way To Stay Fit Anywhere.\r\n\r\nKey Features:\r\n360? Rotating Twister Plate For Full Body Workout\r\n\r\nStrengthens Core Muscles And Tones Waistline\r\n\r\nHelps Burn Calories And Improve Balance\r\n\r\nDurable Plastic Material With Non-Slip Surface\r\n\r\nCompact, Lightweight, And Easy To Carry\r\n\r\nIdeal For Home, Gym, And Office Workouts\r\n\r\nSuitable For Both Men And Women\r\n\r\nEnhances Flexibility, Posture, And Coordination",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:57.193Z",
      "updated_at": "2025-10-24T08:36:57.193Z"
    },
    {
      "id": "sports_water_bottles_mh4lkt1l_14yfk2",
      "name": "Sports Water Bottles 3 Pcs Set With Leak Proof Flip Top Lid (Random Color)",
      "category": "Sports & Outdoors",
      "subcategory": "Outdoor_Gear",
      "price": 1799,
      "original_price": null,
      "description": "Description\r\nSports Water Bottles 3 Pcs Set With Leak Proof Flip Top Lid (Random Color)\r\n\r\n3 piece motivational sports water bottles. SAFE MATERIAL: Our gym water bottle is made of free and healthier. It is suitable for your daily drinking water, leak-proof and dust-proof. GRADIENT RAMP DESIGN: With a stylish gradient look, water bottle with measurements has a strong visual impact that makes you drink water and make you happy. PERFECT GIFTS: Our workout water bottle is the perfect gift for Christmas, birthday, Mother's Day, Valentine's Day, Labor Day, and for family, friends, colleagues or classmates. Kit with 3 bottles of water, goes a bottle inside the Reinforced design, one click to open. -Design with handle, easy to carry. -Anti-clearance -Material: PC. -Capacity: 2000ml,850ml,350ml -3 Bottles random colours",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:57.225Z",
      "updated_at": "2025-10-24T08:36:57.225Z"
    },
    {
      "id": "pack_of_2_hand_gripe_mh4lkt3m_ftqbka",
      "name": "Pack of 2 Hand griper - Gym equipment - hand gripper for building veins",
      "category": "Sports & Outdoors",
      "subcategory": "Fitness_Equipment",
      "price": 979,
      "original_price": null,
      "description": "Build stronger hands, wrists, and forearms with this high-quality **Adjustable Hand Gripper**. Designed for athletes, fitness lovers, and anyone looking to improve grip strength, this tool is perfect for daily workouts or rehabilitation exercises.\r\n\r\n\r\n\r\n? **Durable & Non-Slip Design** ? Made with premium ABS plastic and stainless steel spring for long-lasting use.\r\n\r\n? **Adjustable Resistance** ? Easily adjust from **10kg to 40kg (22lbs ? 88lbs)** to match your fitness level.\r\n\r\n? **Comfortable Grip** ? Ergonomic, anti-slip handles ensure comfort during extended use.\r\n\r\n? **Compact & Portable** ? Lightweight design makes it easy to carry anywhere, whether at home, office, or gym.\r\n\r\n? **Multi-Purpose Training** ? Ideal for improving grip, finger strength, forearm muscles, and aiding recovery from injuries.\r\n\r\n\r\n\r\n**Perfect For:**\r\n\r\n? Gym enthusiasts\r\n\r\n? Sports players (cricket, tennis, badminton, etc.)\r\n\r\n? Musicians (guitarists, pianists)\r\n\r\n? Office workers with long computer use\r\n\r\n? Physiotherapy & rehab exercises\r\n\r\n\r\n\r\n**Package Includes:**\r\n\r\n1 x Adjustable Hand Gripper",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:57.298Z",
      "updated_at": "2025-10-24T08:36:57.298Z"
    },
    {
      "id": "1_pair_thermal_wool__mh4lkuf6_z99oat",
      "name": "1 Pair Thermal Wool Knee Brace Sleeves ? Long Warm Leg Support For Winter, Pain Relief & Joint Protection For Men And Women (Black)",
      "category": "Sports & Outdoors",
      "subcategory": "Sportswear",
      "price": 579,
      "original_price": null,
      "description": "Description\r\n1 Pair Thermal Wool Knee Brace Sleeves ? Long Warm Leg Support For Winter, Pain Relief & Joint Protection For Men And Women (Black)\r\n\r\nStay Warm And Supported With Thermal Wool Knee Sleeves. Designed For Comfort, Flexibility, And Pain Relief ? Ideal For Cold Weather, Daily Use, And Sports Activities.\r\n\r\nThe Thermal Wool Knee Brace Sleeves Provide Exceptional Warmth And Comfort During The Winter Season. Made From Soft, Elastic, And Breathable Knitted Wool Fabric, These Sleeves Offer Superior Coverage And Stay Secure Without Slipping. They Help Retain Heat, Absorb Sweat, And Protect The Knees From Cold And Injury. Designed To Improve Blood Circulation And Relieve Arthritis Pain, These Knee Warmers Are Perfect For Both Men And Women. Lightweight And Easy To Wear Under Clothing, They?re Ideal For Daily Use, Jogging, Cycling, Or Simply Staying Warm Indoors. A Great Gift Choice For Loved Ones During The Cold Season.\r\n\r\nKey Features:\r\n\r\nMade Of High-Quality Knitted Wool FabricSoft, Breathable, And Sweat-Absorbing DesignProvides Warmth And Protection During Cold WeatherHelps Relieve Arthritis And Joint PainEnhances Blood Circulation For Faster RecoverySuitable For Men And WomenLightweight, Elastic, And Non-Slip FitIdeal For Jogging, Running, Cycling, And Daily UseOne Size Fits Most AdultsPerfect Winter Gift For Family And Friends",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:36:59.010Z",
      "updated_at": "2025-10-24T08:36:59.010Z"
    },
    {
      "id": "_1pair__knee_warmer__mh4lkvp5_wtn4wq",
      "name": "(1Pair) Knee Warmer Woolen Knee Cap For Men And Women (random Design)",
      "category": "Sports & Outdoors",
      "subcategory": "Sportswear",
      "price": 799,
      "original_price": null,
      "description": "About this item\r\nWinter Leg Warmers Sleeves is a luxurious and soft wool obtained from cashmere goats. It is known for its warmth and comfort.The use of cashmere wool suggests that the leg warmers are designed to provide insulation, trapping and retaining body heat to keep you warm in cold conditions.Winter Leg Warmers Sleeves is known for its soft and luxurious feel, providing comfort against the skin.\r\nWinter Leg Warmers Sleeves. Crafted for exceptional warmth and comfort, these leg warmers are designed to keep you cozy in the coldest of temperatures. The soft and luxurious fabric ensures a gentle, itch-free experience, all thanks to the inclusion of premium materials like Cashmere Wool. Stay warm, stylish, and comfortable throughout the winter season with these insulating leg warmers.",
      "features": [],
      "images": [],
      "image_count": 0,
      "in_stock": true,
      "created_at": "2025-10-24T08:37:00.665Z",
      "updated_at": "2025-10-24T08:37:00.665Z"
    }
  ]
}