[
  {
    "id": "prod_5eecafba",
    "name": "Men s Leather Wallet (Plain Black with Contrast Red Line)",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Accessories",
    "price": 700,
    "stock": 999,
    "description": "Plain Black with Contrast Red Line\r\nFaux Soft Leather\r\n3.5? X 4.0? X 0.75? (Closed)\r\nOne zipper coin pocket\r\nTwo pocket for receipts.\r\nOne Window for ID/Driver?s license\r\nSix card Holder",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-8W63",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.355Z",
    "content_hash": "bd25cea2bb0b23895479b41230a52f65"
  },
  {
    "id": "prod_de1179f9",
    "name": "Men?s Genuine Sheep Leather Winter Gloves ? Black Motorcycle Riding Gloves with Warm Lining",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Accessories",
    "price": 749,
    "stock": 999,
    "description": "Upgrade your winter gear with these premium Men?s Genuine Sheep Leather Gloves, crafted for both style and performance. Made from 100% pure sheep leather, these gloves offer a luxuriously soft feel while delivering exceptional durability and warmth?perfect for chilly weather and outdoor adventures.\r\n\r\nThe interior features a thermal warm-up lining that traps heat efficiently, keeping your hands cozy even in cold conditions. Whether you&#x27;re riding your bike, commuting, or simply braving the winter chill, these gloves provide the protection and comfort you need.\r\n\r\nDesigned with adjustable wrist straps, they ensure a secure fit and help block out wind and cold air. The sleek black finish and reinforced stitching add a touch of rugged elegance, making them suitable for both casual and active wear.\r\n\r\n? Key Features\r\nMaterial: leather glovesColor: Classic BlackLining: Warm insulated interior for winter useUse: Ideal for biking, riding, and cold weather protectionStyle: Sleek, padded design with reinforced stitching",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-QRP2",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.377Z",
    "content_hash": "fdfcbd50f1716f166927e18688b1840b"
  },
  {
    "id": "prod_b48facd6",
    "name": "Premium Zipper Jacket For Men | French Fleece Fabric | Smart Look, Comfortable Wear, Easy Wash",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Clothing",
    "price": 979,
    "stock": 999,
    "description": "Description\r\nPremium Zipper Jacket For Men | French Fleece Fabric | Smart Look, Comfortable Wear, Easy Wash\r\n\r\nStylish Zipper Jacket For Men Made With French Fleece Fabric. Comfortable, Smart Looking, And Premium Quality With Sizes From Medium To Extra Large.\r\n\r\nUpgrade Your Wardrobe With This Premium Zipper Jacket For Men Designed With High Quality French Fleece Fabric. It Features A Fashionable Design, Smart Look, And Durable Stitching That Ensures Comfort And Long Lasting Wear. Perfect For Casual Outings, Everyday Use, Or Layering In Cooler Weather. Easy To Wash And Ready To Wear, This Jacket Combines Style With Practicality. Available In Medium, Large, And Extra Large Sizes To Suit Your Fit. For Best Results, Hand Wash Is Recommended To Maintain Quality And Longevity.\r\n\r\nKey Features:\r\n100% New And Good QualityStylish Zipper Jacket For MenPremium French Fleece FabricFashionable And Smart DesignDurable And Well StitchedComfortable And Ready To WearEasy To Wash And MaintainSizes Available: Medium, Large, Extra LargeRecommended Hand Wash For Long Life",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-20JW",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.391Z",
    "content_hash": "94c5f66ae31cfe998e73ce9eac71bde8"
  },
  {
    "id": "prod_d5836eab",
    "name": "Fashion Men Sling Bag Pack with Lock Waterproof Anti-Theft Chest Bag with USB Charging Port Shoulder Bag Body Backpack with TSA Lock (Random Color)",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Accessories",
    "price": 2299,
    "stock": 999,
    "description": "Description\r\nFashion Men Sling Bag Pack with Lock Waterproof Anti-Theft Chest Bag with USB Charging Port Shoulder Bag Body Backpack with TSA Lock\r\n\r\nFashion Men Sling Bag Pack With Lock Is Designed For Modern Men Who Value Style, Security, And Convenience. Made From High-Quality Waterproof Material, This Anti-Theft Chest Bag Keeps Your Essentials Safe And Dry In Any Weather. The Built-In USB Charging Port Allows You To Charge Devices On The Go, While The TSA-Approved Lock Provides Extra Protection Against Theft. With Multiple Compartments, It Offers Ample Space For Gadgets, Wallets, Keys, And More. Ideal For Travel, Work, And Everyday Use, This Shoulder Body Backpack Combines Comfort And Durability With A Sleek, Fashionable Design.\r\n\r\nKey Features:\r\nPremium Waterproof Material For Long-Lasting UseBuilt-In USB Charging Port For On-The-Go ConvenienceAdvanced TSA Lock For Anti-Theft SecurityAdjustable Shoulder Strap For Comfortable CarryingMultiple Compartments For Organized StorageStylish And Modern Design For Daily WearIdeal For Travel, Office, And Outdoor ActivitiesLightweight, Durable, And Easy To CarryRandom Color",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-KOQF",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.393Z",
    "content_hash": "ca9af89115611d49693d68aa361d8f83"
  },
  {
    "id": "prod_5acbfc15",
    "name": "Original Buffalo Leather Trifold Wallet for Men -Brown",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Accessories",
    "price": 1499,
    "stock": 999,
    "description": "Experience timeless craftsmanship with the Original Buffalo Leather Trifold Wallet for Men. Made from authentic, full-grain buffalo leather, this wallet delivers unmatched durability, rich texture, and a refined vintage look that improves with age.\r\n\r\nDesigned for both practicality and elegance, it features multiple card compartments, an ID window, a spacious bill section, and a dedicated coin pocket ? all while maintaining a slim, pocket-friendly profile. The handcrafted stitching and natural leather aroma reflect premium artistry, making it an ideal everyday essential or a thoughtful gift for men who value quality and style.\r\n\r\nKey Features:\r\n\r\n100% Original Buffalo Leather ? durable and long-lastingTrifold Design ? compact yet spacious layoutMultiple Card Slots & ID WindowSlim, lightweight, and comfortable to carryHandcrafted with fine stitching and detailPerfect gift for men on any occasionColors Black Brown Bronze",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-5M3O",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.400Z",
    "content_hash": "91e81d6924e325c8d8f8e6803faa3e83"
  },
  {
    "id": "prod_f4bf6f82",
    "name": "Wool Cap With Neck Warmer | Beanie And Scarf Set With Fleece Mask | Winter Thermal Wool Cap For Men And Women (Blue)",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Accessories",
    "price": 599,
    "stock": 999,
    "description": "Description\r\nWool Cap With Neck Warmer | Beanie And Scarf Set With Fleece Mask | Winter Thermal Wool Cap For Men And Women\r\n\r\nWool Cap With Neck Warmer Is A Perfect Winter Accessory Set Designed To Keep You Warm And Comfortable During Cold Weather. This Beanie Cap Comes With A Matching Neck Warmer Scarf And Fleece Mask For Full Face Protection. Made From Premium Wool And Lined With Soft Fleece, It Offers Excellent Insulation Against The Cold While Remaining Breathable And Comfortable. Its Stretchable Design Ensures A Perfect Fit For Both Men And Women. Ideal For Outdoor Activities Like Cycling, Skiing, Hiking, Or Daily Winter Wear, This Set Combines Functionality, Warmth, And Style In One Package.\r\n\r\nKey Features:\r\nPremium Wool Material With Soft Fleece LiningIncludes Beanie Cap, Neck Warmer, And Fleece MaskProvides Full Face And Neck Protection In Cold WeatherStretchable And Comfortable Fit For Men And WomenStylish And Modern Design Suitable For All OutfitsIdeal For Winter Outdoor Activities And Daily UseRetains Warmth While Allowing BreathabilityEasy To Wash And Maintain For Long-Lasting Use",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-0NOM",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.425Z",
    "content_hash": "43becf14023c77f130c5a2c4ae1c2d73"
  },
  {
    "id": "prod_3e8ce946",
    "name": "Full BLACK AURA Quartz Watch ? Lightweight Design, , Premium Quality &amp; Finish - Best Quality Analog Watch For Boys - Watch For Men | Full Black Color Watch - Without Box",
    "category": "Men&#x27;s Fashion",
    "subcategory": "Men&#x27;s_Watches",
    "price": 949,
    "stock": 999,
    "description": "Full BLACK AURA Quartz Watch ? Lightweight Design, , Premium Quality & Finish - Best Quality Analog Watch For Boys - Watch For Men | Full Black Color Watch - Without Box\r\nWatch Type: AnalogGender: Men, BoysFiber body\r\nKey Features:\r\nQuartz Movement ? Accurate and reliable timekeepingLightweight Build ? Comfortable for everyday wearButterfly Lock ? Secure and stylish claspHigh-Quality Finish ? Sleek design with premium craftsmanship",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MEN-XOUV",
    "status": "active",
    "last_updated": "2025-10-24T09:12:21.440Z",
    "content_hash": "64e3fb761f67fda2b96f88e71fc16b8e"
  }
]