[
  {
    "id": "prod_ca79b9ec",
    "name": "Metal Hand Press Tich Button Machine With 25 Button\r",
    "category": "Motors",
    "subcategory": "Tools_Equipment",
    "price": 599,
    "description": "Description\r\nBrand New and High Quality:This Metal Hand Press Snap Button Pliers kit is a brand-new product known for its durability and performance.User-Friendly Design:The Metal Hand Press Snap Button Pliers kit are designed to be easy to hold, providing elasticity and reducing hand pressure. They are user-friendly, making them versatile and handy tools.Caution on Direction:It's essential to pay attention to the alignment of the buttonhole and the pliers. Using them in the wrong direction may result in damage to the buttonhole or the tool.Multi-Functional Use:This kit can be used for a wide range of applications, including banners, tarpaulins, garments, bags, baby clothes, and more. Its versatility makes it an indispensable tool for various projects.Compact and Convenient:The kit is lightweight, compact, and easy to store. It won't take up much space in your toolbox or storage area, ensuring convenience and practicality.Material:Made from durable metal, the kit is built to last, ensuring long-term usability.Size:The kit's size is as shown in the picture, providing a compact and manageable form factor for easy handling",
    "images": [
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/09/2e2706a3e4c71db06d4d3378363dc4c0.jpg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/09/36fe45102ad215178a6c3a5393c1bd68.webp",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/09/41f29cbfe09d616ff70baa4aaa405ff6.webp",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/09/ce687e9cb8216ba0a66e037ba652716f.webp",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/10/7798f8d85e8243da4985756c40b8e2da.png"
    ],
    "image_count": 5
  },
  {
    "id": "prod_91f435b2",
    "name": "2Pcs Universal Handle Gloves For Bike ? Winter Motorcycle Riding Gloves, Windproof And Warm Hand Protection For All Bikes\r",
    "category": "Motors",
    "subcategory": "Motorcycles",
    "price": 639,
    "description": "Description\r\n2Pcs Universal Handle Gloves For Bike ? Winter Motorcycle Riding Gloves, Windproof And Warm Hand Protection For All Bikes\r\n\r\nStay Warm And Protected On Every Ride With These 2Pcs Universal Handle Gloves For Bikes. Designed For Winter And Cold Weather Riding, These Gloves Offer Excellent Windproof And Thermal Protection. Made From Durable, High-Quality Material, They Fit Securely On Any Motorcycle Or Scooter Handle, Keeping Your Hands Warm And Comfortable. The Universal Fit Ensures Easy Installation And Compatibility With All Bike Models. Ideal For Daily Commuting Or Long-Distance Riding, These Gloves Provide A Perfect Blend Of Comfort, Protection, And Style For Every Biker.\r\n\r\nKey Features:\r\n\r\n2Pcs Universal Handle Gloves For All Bike ModelsWindproof And Thermal Protection For Winter RidingKeeps Hands Warm And Comfortable In Cold WeatherDurable And High-Quality Material For Long UseEasy To Install And Remove From Handle GripsSuitable For Motorcycles, Scooters, And ScootiesPerfect For Daily Commutes And Long RidesStylish Design With Practical Functionality",
    "images": [
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/11/112237757b6a403688a8ac7008cc377f.jpeg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/11/25b18e58767bcb3844c236cc144ce5f5.jpeg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/11/a84e7962c65a85267df6ad303fb04fb7.jpeg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/11/bbe550a68cddca6ebd532aea12551db0.jpeg"
    ],
    "image_count": 4
  },
  {
    "id": "prod_831e8cf3",
    "name": "Heavy Furniture Mover Tool Set | Easy To Use Ergonomics Design Furniture Moving Tool Best For Home, Office\r",
    "category": "Motors",
    "subcategory": "Tools_Equipment",
    "price": 949,
    "description": "Description\r\nHeavy Furniture Mover Tool Set | Easy To Use Ergonomics Design Furniture Moving Tool\r\nProduct Details:Product Material: Iron+ABS.Maximum Load Bearing: 150 kg.Ergonomics DesignThe furniture lifting tool allows the furniture to move easily with its own strength.The ergonomic design allows you to lift and move heavy furniture and equipment without pulling your back.Safety Design360-degree rotatable foot pads match the furniture feet and equipment feet which are firmly fixed.Easy to Use and easy to carry.You can quickly and efficiently work.Allows you to move furniture or heavy objects easier.Application: Suitable for sofa, bookcase, table, chair, bed, piano, washer, dryer, refrigerator etc.",
    "images": [
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/13/d3c35430157a6aec91e13f7adbdad074.jpeg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/13/5d66f0f526b9d26483b2679db0074145.png",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/13/757745c276385d61e64904b156d56cc3.jpg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/13/f15e6d9d1cce56b3b529345c8015f2fa.png"
    ],
    "image_count": 4
  },
  {
    "id": "prod_269c7c94",
    "name": "Solar Powered Car Aroma Diffuser ? Helicopter Design Air Freshener Perfume for Dashboard\r",
    "category": "Motors",
    "subcategory": "Car_Accessories",
    "price": 1690,
    "description": "Upgrade your car?s interior with this Solar Powered Helicopter Car Aroma Diffuser, combining style, freshness, and innovation. The built-in solar panel spins the helicopter blades when exposed to sunlight, releasing a soothing fragrance throughout your car. Crafted with premium materials and a sleek design, it not only eliminates unpleasant odors but also adds a touch of elegance to your dashboard.\r\n\r\nPerfect for car enthusiasts who value both aesthetics and freshness, this eco-friendly air freshener ensures a long-lasting, refreshing drive every time.",
    "images": [
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/17/64121baae90e729bad5864c0c43c887f.jpeg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/17/41477a20a56435f8f8cadc84e53dbf1a.jpg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/17/78ae2946fe3af510be4a39de71adb788.jpg",
      "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/17/25fcd5a2df599f1c2ceea0c59cdb1a9e.jpg"
    ],
    "image_count": 4
  }
]