[
  {
    "id": "prod_15367b0ab25f",
    "name": "Finex Hair Spray Strong Hold All Day Style and Control",
    "category": "Health & Beauty",
    "subcategory": "Hair_Care",
    "price": 879,
    "stock": 999,
    "description": "Finex Strong Hold Hair Spray for all-day style and control.\r\n? Fragrance-free formula for a natural feel.\r\n? Perfect for men's hair styling needs.\r\n? Provides a strong hold without stiffness.\r\n? Ideal for all hair types and lengths.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-VCFI",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.435Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_57872cc67769",
    "name": "Dingling rf 608b 100% Original rechargeable with charge base Hair And Beard shaving machine And Grooming For Men Dingling rf 608b",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 2200,
    "stock": 999,
    "description": "Model:Rf-608B Brand: Dingling New Model 100% Original Android And USB Charging Charging time 6-7 Hours Backup Nearly 45 mins Adjustable Razor , Lasting And Durable Cordless Operation, Easy To Use Long Time Battery capacity Battery capacity 1000 m 1 Extra clippe Cutter Width 0.5-6 Auto adjestme soundle Super -mute Desi Best use for every propos Original Pictures Acttach ExcellentTechnolo Sharp blade, enduran Rechargeabl Hair Trimmer And Shaver For Men ? Silve shaving machine for m Advanced Shaving system, Titanium plated bottom blade +Stainless moving up bla High Capacity Rechargeable Batteriesdeenr,e.cegyededgnssntmmrsah",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-17HH",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.459Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_e22fabfade34",
    "name": "kemei 3 In 1 Professional Hair Trimmer Nose Beard Trimmer Safe Face Care Hair Cutting Machine Rechargable Hair Clipper",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 1999,
    "stock": 999,
    "description": "Kemei\r\nHair Clipper Razor Shaver Nose Trimmer 3 in 1 beard styling for men Rechargeable Hair Removal Machine\r\norignal kemei shaving machine km 6330, km 6331, km 6332, km 6333 3 in 1\r\nkemei 3 in 1\r\nBest Shaver\r\nHair Remover\r\nKemei Trimmer\r\n3 in 1 trimmer\r\nHair Shaver\r\nMen trimmer\r\nTrimmer\r\nShaver\r\nItem Type: Electric Shaver\r\nFeature: Twin Blade\r\nPower Type: Rechargeable\r\nModel Number: KM-6330, KM-6331, KM-6332, KM-6333\r\nWith trimming device: Yes\r\nPower: 3W\r\nVoltage: 220V\r\nFrequency: 50Hz\r\ncolour:Black, Blue\r\nmaterial:ABS\r\nsize:17.3*4.7cm\r\nPackage Contents:1*Shaver1*Nose hair1*Haircut limit comb1*Cleaning brush1*Charger1 * oil bottle1*Instructions",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-19QC",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.462Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_971a9ef488c2",
    "name": "Black Color Rechargeable T9 Trimmer & Electric Hair Clipper, Beard Trimmer",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 1100,
    "stock": 999,
    "description": "Color: Black\r\nMaterial: ABS\r\nItem Type: Hair Trimmer\r\nMaterial: 0mm Moser\r\nCertification: CE\r\nModel Number: razor\r\nSize: 14.5*4cm\r\nModel Number: Hair Trimmer Razor trimmer\r\nFeature4: Rechargeable Hair Trimmers",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-Z0M8",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.477Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_772a08c58cc5",
    "name": "Mocallure 12-Color Lip Palette / Long-Lasting Professional Lip Kit For Every Mood",
    "category": "Health & Beauty",
    "subcategory": "Makeup",
    "price": 1400,
    "stock": 999,
    "description": "TheMocallure 12-Color Lip Paletteis a versatile and budget-friendly makeup essential, perfect for those who love experimenting with different lip looks. This palette offers a range of shades suitable for various occasions, from everyday wear to special events.\r\n\r\n? Product Highlights\r\n12 Vibrant Shades: The palette includes a mix of matte and shiny finishes, allowing you to create diverse lip looks.Long-Lasting Formula: Designed to stay in place throughout the day without fading or smudging.Moisturizing Ingredients: Infused with Moringa Oil, Raspberry Seed Oil, and Vitamin E to nourish and hydrate your lips.Portable Design: Compact and lightweight, making it ideal for travel and on-the-go touch-ups.Shades: Pink , Red , Mahron , PeachSize ; 2.5g",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-SIHV",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.558Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_026ccab26c65",
    "name": "Digital Therapy Machine BLD-610 ? Multifunctional Electric Pulse Massager for Pain Relief, Acupuncture, Muscle Relaxation & Body Massage",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 2299,
    "stock": 999,
    "description": "Description\r\nDigital Therapy Machine BLD-610 ? Multifunctional Electric Pulse Massager for Pain Relief, Acupuncture, Muscle Relaxation & Body Massage.\r\n\r\nExperience effective pain relief and relaxation with this Multifunctional Digital Therapy Massager BLD-610, designed to provide a professional massage experience at home. This advanced electric pulse massager combines multiple therapy modes including stroke, manipulation, acupuncture, cupping, massage, and scraping, making it a versatile solution for muscle tension, joint stiffness, and body fatigue. Equipped with multiple electrode pads, it targets different areas of the body such as shoulders, back, waist, arms, and legs to improve blood circulation, ease muscle pain, and promote relaxation. The easy-to-use digital display allows you to adjust modes and intensity levels according to your comfort, making it suitable for people of all ages. Lightweight and portable, it is perfect for home use, office breaks, or even travel. Whether you are looking for stress relief, physiotherapy support, or everyday muscle relaxation, this multifunctional therapy massager is an excellent choice to keep your body energized and pain-free.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-FPQH",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.606Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_9b51160c40ac",
    "name": "Crown Intense Men?s Perfume ? 100ml Long-Lasting Eau de Parfum with 24-Hour Scent",
    "category": "Health & Beauty",
    "subcategory": "Fragrances",
    "price": 1599,
    "stock": 999,
    "description": "Unleash your signature scent with Crown Intense Men?s Perfume, a premium fragrance crafted for the modern man. Housed in a sleek 100ml bottle, this Eau de Parfum delivers a rich, long-lasting aroma that stays vibrant for up to 24 hours, guaranteed.\r\n\r\nDesigned to evoke strength, sophistication, and allure, Crown Intense features a bold blend of aromatic notes that transition smoothly from day to night. Whether you're heading to the office, a night out, or a special occasion, this fragrance keeps you feeling fresh and confident all day long.\r\n\r\nIts high-concentration formula ensures maximum longevity, while the elegant packaging makes it an ideal gift for yourself or someone special. No need for reapplication?just one spray and you're set for the day.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-8ZWK",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.610Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_fa23ef0e0098",
    "name": "Jhoom Beauty Whitening Cream And Soap Set With Avocado Extract ? Natural Skin Brightening, Deep Cleansing, And Glowing Complexion",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 970,
    "stock": 999,
    "description": "Description\r\nJhoom Beauty Whitening Cream And Soap Set With Avocado Extract ? Natural Skin Brightening, Deep Cleansing, And Glowing Complexion\r\n\r\nExperience The Power Of Natural Radiance With The Jhoom Beauty Whitening Cream And Soap Set. Enriched With Avocado Extracts, Aloe Vera, And Essential Vitamins, This Dual-Action Skincare Combo Deeply Cleanses, Hydrates, And Brightens The Skin. The Beauty Soap Removes Dirt, Oil, And Impurities While Maintaining Skin Moisture, And The Whitening Cream Enhances Fairness, Reduces Dark Spots, And Gives A Smooth, Even-Toned Complexion. Suitable For All Skin Types, It Helps Restore Natural Glow And Softness With Visible Results In Just 3 Days. Perfect For Daily Use To Achieve Fresh, Luminous, And Healthy-Looking Skin.\r\n\r\nKey Features:\r\nNatural Avocado Extracts For Deep Nourishment And Hydration\r\n\r\nBrightens And Whitens Skin Tone Within 3 Days Of Regular Use Reduces Dark Spots, Pigmentation, And Uneven Skin Tone\r\n\r\nSoap Gently Cleanses While Maintaining Skin Moisture\r\n\r\nWhitening Cream Enhances Glow And Smooth Texture\r\n\r\nInfused With Vitamins And Natural Moisturizers\r\n\r\nSuitable For All Skin Types ? Safe For Daily Use\r\n\r\nProvides A Fresh, Radiant, And Youthful Complexion\r\n\r\nNet weight Cream 30g | Soa 125g\r\n\r\nQuality Original",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-43TK",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.613Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_0f88df67e93d",
    "name": "Hair Drying Towel Cap ? Quick Dry, Soft & Absorbent Turban Wrap For Women | Anti-Frizz Hair Wrap Towel For Bathroom & Salon Use (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 340,
    "stock": 999,
    "description": "Say goodbye to heavy, dripping towels and enjoy effortless hair drying with ourMicrofiber Hair Drying Towel Cap. Designed with premium-quality microfiber fabric, this towel quickly absorbs excess water from your hair, cutting drying time in half while keeping your strands smooth and frizz-free. Its lightweight, soft, and skin-friendly material makes it perfect for all hair types ? whether long, short, curly, or straight.\r\n\r\nThe convenient button loop design ensures a secure fit, so you can move freely while your hair dries naturally ? no slipping or re-wrapping needed. Ideal for daily use after a shower, gym workout, swimming session, or spa day, this towel helps protect hair from heat damage caused by blow-drying.\r\n\r\nAvailable in multiple soothing colors, theMicrofiber Hair Drying Towel Capcombines comfort, functionality, and style ? making it an essential part of your beauty and self-care routine. Easy to wash, quick to dry, and reusable for long-term use.\r\n\r\nColors : Random",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-LKYT",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.629Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_309078fa348c",
    "name": "Guanjing Brighten Serum 40Ml With Facial Massager ? Deep Nourishing Skin Care Set To Fade Fine Lines And Restore Youthful Glow (GJ7207)",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 1699,
    "stock": 999,
    "description": "Description\r\nGuanjing Brighten Serum 40Ml With Facial Massager ? Deep Nourishing Skin Care Set To Fade Fine Lines And Restore Youthful Glow (GJ7207)\r\n\r\nReveal Radiant, Youthful Skin With The Guanjing Brighten Serum 40Ml And Facial Massager Set. This Advanced Skincare Duo Deeply Nourishes The Skin, Improves Texture, And Reduces Fine Lines For A Healthier, Brighter Look. The Serum Is Enriched With Active Ingredients That Restore Moisture And Revitalize Dull Skin, While The Facial Massager Enhances Absorption And Stimulates Blood Circulation. Ideal For Daily Use, This Set Helps Achieve Noticeably Smoother, Firmer, And More Luminous Skin In Just 28 Days. Perfect For All Skin Types Seeking A Natural, Youthful Glow.\r\n\r\nKey Features:\r\nGuanjing Brighten Serum 40Ml With Facial Massager\r\n\r\nDeeply Nourishes And Hydrates The Skin\r\n\r\nHelps Fade Fine Lines And Wrinkles\r\n\r\nImproves Skin Texture And Elasticity\r\n\r\nEnhances Natural Glow And Radiance\r\n\r\nStimulates Blood Circulation For Healthy Skin\r\n\r\nRestores Youthful And Smooth Complexion\r\n\r\nSuitable For All Skin Types And Daily Use",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-8VAB",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.685Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_db79ace66713",
    "name": "High Quality 5 In 1 Hair Styler Brush | Hair Straightener, Curler, Blow Dryer & Volumizer | Negative Ionic Electric Air Wrap With Detachable Brush Heads (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Hair_Care",
    "price": 3899,
    "stock": 999,
    "description": "Description\r\nHigh Quality 5 In 1 Hair Styler Brush | Hair Straightener, Curler, Blow\r\n\r\nDryer & Volumizer | Negative Ionic Electric Air Wrap With Detachable Brush Heads (Random Color)\r\n\r\nHigh Quality 5 In 1 Hair Styler Is The Ultimate All-In-One Hair Care Tool Designed To Deliver Salon-Quality Results At Home. Made From Premium ABS And Aluminum Alloy, It Features Advanced Negative Ion Technology And A Ceramic Coating To Reduce Frizz, Enhance Shine, And Protect Hair From Heat Damage.\r\n\r\nWith 3 Adjustable Heat Settings And A Powerful 1000W Motor, This Hair Styler Allows You To Customize Your Styling Experience Based On Hair Type And Texture. The Detachable Brush Heads Make It Easy To Switch Between Straightening, Curling, Drying, And Volumizing, While The 360? Swivel Cord Offers Effortless Maneuverability.\r\n\r\nPerfect For Creating Sleek, Bouncy, Or Wavy Hairstyles, This Lightweight And Compact Tool Is Also Travel-Friendly. Its Stylish Design Makes It An Ideal Gift For Women Who Love To Maintain Gorgeous Hair Anytime, Anywhere.\r\n\r\nKey Features:\r\n\r\n5 In 1 Multi-Functional Hair Styling Tool\r\n\r\nCombines Dryer, Curler, Straightener, Volumizer, And Massager\r\n\r\nMade From Premium ABS And Aluminum Alloy Materials\r\n\r\nAdvanced Negative Ion And Ceramic Coating Reduces Frizz\r\n\r\n3 Adjustable Heat Settings With 1000W Power Output\r\n\r\nDetachable Brush Heads For Easy Cleaning And Versatility\r\n\r\nErgonomic Handle With 360? Swivel Cord For Easy Use\r\n\r\nSafe For All Hair Types ? Straight, Wavy, Or Curly\r\n\r\nCompact And Travel-Friendly Design For On-The-Go Styling\r\n\r\nPerfect Gift Choice For Women And Beauty Enthusiasts\r\n\r\nRandom Color",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-CLM5",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.712Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_cb1a8907370c",
    "name": "Elixovia Vitamin C Plus Face Serum ? Brightening & Hydrating Formula with Alpha Arbutin, Glutathione & Hyaluronic Acid (30ml)",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 869,
    "stock": 999,
    "description": "Transform your skincare routine with Elixovia Vitamin C Plus Face Serum, a potent blend of skin-loving ingredients designed to brighten, hydrate, and rejuvenate. This lightweight serum combines the power of Vitamin C for radiance, Alpha Arbutin to visibly brighten skin tone, Glutathione to reduce dark spots, and Hyaluronic Acid for deep, lasting hydration.\r\n\r\nPerfect for all skin types, this serum absorbs quickly without leaving a greasy residue, making it ideal for daily use under makeup or as part of your nighttime routine. The elegant dropper bottle ensures precise application, while the golden cap adds a touch of luxury to your skincare shelf.\r\n\r\nKey Benefits:\r\n\r\n? Brightens dull skin and evens out tone? Reduces appearance of dark spots and pigmentation? Provides intense hydration and plumps skin? Lightweight, fast-absorbing formula? Enriched with Vitamin C, Alpha Arbutin, Glutathione & Hyaluronic Acid? 30ml dropper bottle for easy application\r\nGive your skin the glow it deserves with Elixovia?where science meets skincare.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-S6TV",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.724Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_2953fcec2dc8",
    "name": "Elixovia Niacinamide Plus Acne Warrior Serum ? Brighten, Balance & Clarify (30ml)",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 869,
    "stock": 999,
    "description": "Unleash your skin?s potential with Elixovia Niacinamide Plus Acne Warrior, a targeted serum designed to fight breakouts and restore clarity. Infused with high-performance niacinamide, this lightweight formula works deep within the skin to:\r\n\r\n? Brighten dull and uneven skin tone?? Balance oil production and reduce shine? Clarify pores and minimize blemishes\r\nPerfect for acne-prone and sensitive skin, this 30ml serum is your daily defense against inflammation, discoloration, and congestion. The clean, minimal packaging reflects its pure, skin-loving ingredients?no harsh additives, just results.\r\n\r\nWhether you're battling persistent breakouts or looking to refine your skin texture, Elixovia Niacinamide Plus is your go-to solution for a calm, clear, and confident complexion.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-WOBV",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.746Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_35ef27e7b18a",
    "name": "IKT KERATIN NUTRITION 75g",
    "category": "Health & Beauty",
    "subcategory": "Hair_Care",
    "price": 599,
    "stock": 999,
    "description": "Tame flyaways, smooth frizz, and perfect your edges with our professional-grade Hair Wax Stick. This easy-to-use styling product offers a strong, all-day hold without leaving your hair stiff, greasy, or flaky. Achieve a polished look, whether you're securing a sleek ponytail, smoothing a part, or creating detailed texture.\r\n\r\n\r\n\r\nKey Features\r\n\r\n\r\nNon-Greasy Formula: Provides a firm hold and a natural finish without weighing hair down.Frizz & Flyaway Control: Instantly smooths down stray hairs and baby hairs for a clean, sleek appearance.Deep Conditioning: Formulated with moisturizing ingredients to nourish your hair while styling.Easy Application: The solid stick format allows for precise and mess-free application directly to the hair.Long-Lasting Hold: Keeps your style intact throughout the day.Size: Each stick is 75g (2.7 fl. oz.).\r\n\r\n\r\nAvailable Variants\r\n\r\n\r\nWe offer two distinct formulations designed for healthy, smooth styling:\r\n\r\nKeratin Nutrition (I.K.T.): Formulated with Keratin for intensive nourishment and smoothing. Recommended for restoring vitality and managing texture, this variant is the key to sleek, healthy-looking hair. (Note: The image shows 98% for damaged hair.)Argan Oil & Protein (Lightness): Enriched with Argan Oil and Protein to provide deep moisturizing and brilliant shine. This stick is perfect for promoting hair health while locking in your style. (Note: The image shows 95% for damaged hair.)\r\n\r\n\r\nHow to Use\r\n\r\n\r\nApply the stick directly to the areas of the hair you want to control, smooth, or add texture to. For flyaways, gently smooth the stick over the surface of the hair. Use a comb or your fingers to refine the style.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-D49A",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.806Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_854b977d63ab",
    "name": "Dr. Rubina Weight Loss Solution | Herbal Slimming, Digestion & Energy Support Formula",
    "category": "Health & Beauty",
    "subcategory": "Health_Supplements",
    "price": 479,
    "stock": 999,
    "description": "The Weight Loss Solution by Dr. Rubina is a carefully crafted herbal formula designed to support healthy weight management, digestion, and energy levels. Infused with powerful natural ingredients like green tea, ginger, turmeric, and carom seeds, this blend helps promote internal cleansing, metabolism, and overall wellness. Gentle yet effective, it?s an ideal choice for those seeking a natural weight loss aid.\r\n\r\nKey Features\r\n\r\n? Supports healthy weight management and fat metabolism\r\n\r\n? Promotes digestion and relieves bloating naturally\r\n\r\n? Enriched with antioxidants for energy and vitality\r\n\r\n? Helps maintain clear skin and internal cleansing\r\n\r\n? 100% natural herbal blend, safe for regular use\r\n\r\n? Suitable for both men and women\r\n\r\nIngredients / Materials\r\n\r\nMain Ingredients: Green Tea Extracts, Ginger, Turmeric, Carom Seeds (Ajwain)\r\n\r\nOther Ingredients: Kalonji (Nigella sativa), Isabgol (Psyllium husk), Fenugreek, Mint, Fennel Seeds\r\n\r\nPackage Includes\r\n\r\n? 1 ? Dr. Rubina Weight Loss Solution (250g)",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-WQNU",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.819Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_5e6b53b91522",
    "name": "6-Piece Hijama Cupping Therapy Set ? Vacuum Suction Massage Cups with Pull-Out Pump | Pain Relief, Blood Circulation, Relaxation & Muscle Recovery Kit",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 1120,
    "stock": 999,
    "description": "Discover the power of traditional healing with this 6-Piece Hijama Cupping Therapy Set, designed for safe and effective cupping sessions. The set includes durable, transparent cups and a manual pull-out vacuum pump, allowing precise control over suction intensity for a comfortable and personalized experience.\r\n\r\nCupping therapy is known to improve blood circulation, release muscle stiffness, and remove toxins from the body. It helps in reducing pain, fatigue, and inflammation, making it an ideal choice for athletes, wellness enthusiasts, or anyone seeking relaxation and rejuvenation.\r\n\r\nMade from high-quality, reusable materials, this cupping kit is lightweight, portable, and easy to clean?perfect for both home users and professional therapists. Whether used for muscle recovery, stress relief, or overall wellness, this set brings the ancient art of Hijama into your modern self-care routine.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-RHIT",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.821Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_480d73c473d1",
    "name": "Bioplex Hair Protein Treatment 50g ? No Damage Formula For Bleaching And Coloring | Protein Balls For Soft, Shiny, And Healthy Blonde Hair",
    "category": "Health & Beauty",
    "subcategory": "Hair_Care",
    "price": 370,
    "stock": 999,
    "description": "Description\r\nBioplex Hair Protein Treatment 50g ? No Damage Formula For Bleaching And Coloring | Protein Balls For Soft, Shiny, And Healthy Blonde Hair\r\n\r\nBioplex Hair Protein Treatment 50g Is A Professional-Grade Hair Repair Solution Specially Designed To Protect And Nourish Hair During Chemical Treatments Like Bleaching And Coloring. Enriched With Golden Protein Balls, It Strengthens Hair Fibers From Within, Reducing Breakage, Frizz, And Dryness. This Advanced Formula Works To Rebuild Damaged Keratin Bonds, Leaving Hair Soft, Silky, And Radiant. Perfect For Achieving Stunning Blonde Shades Without Compromising Hair Health. Suitable For All Hair Types, Especially Colored, Treated, Or Dry Hair. Experience Salon-Like Results At Home With The Power Of Bioplex.\r\n\r\nKey Features:\r\nAdvanced No Damage Formula For Bleached And Colored HairStrengthens And Repairs Damaged Hair FibersEnriched With Golden Protein Balls For Deep NourishmentRestores Shine, Smoothness, And ElasticityProtects Hair During Bleaching And ColoringReduces Breakage, Frizz, And DrynessSuitable For All Hair Types, Especially Treated HairIdeal For Achieving Healthy, Shiny, And Vibrant Blonde HairQuality Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-ZI4G",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.828Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_a31ee83c0514",
    "name": "Derma Suction Pore Cleaning Device With Powerful Vacuum Action Gently Removes Dirt, Oil, And Blackheads, Leaving Skin Clean, Smooth, And Refreshed (Cell Operated)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 920,
    "stock": 999,
    "description": "Description\r\nDerma Suction Pore Cleaning Device With Powerful Vacuum Action Gently Removes Dirt, Oil, And Blackheads, Leaving Skin Clean, Smooth, And Refreshed.\r\n\r\nDerma Suction Pore Cleaning Device Is A High-Quality Facial Beauty Tool Designed To Deeply Cleanse Pores And Remove Blackheads, Dirt, And Excess Oil. Equipped With Vacuum Suction Technology, It Effectively Extracts Impurities Without Damaging The Skin. This Cell Operated Device Is Easy To Use, Portable, And Perfect For Regular Skin Care Routines. It Helps Improve Blood Circulation, Tightens Skin, And Leaves Your Face Looking Fresh, Smooth, And Radiant. Suitable For All Skin Types And Ideal For Home Or Travel Use.\r\n\r\nKey Features:\r\nPowerful Vacuum Suction For Deep Pore CleaningRemoves Blackheads, Whiteheads, Dirt, And Excess OilImproves Skin Texture And Promotes CirculationEasy To Use And Gentle On All Skin TypesCompact, Lightweight, And Cell OperatedHelps Tighten Skin And Reduce Pore SizePerfect For Daily Facial Care And Home Spa UseDurable Design With Comfortable Grip",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-MH06",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.933Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_a6b16f130437",
    "name": "MELODINE Japanese Soothing Massage Gel ? Muscle & Joint Pain Relief Cream For Shoulder, Neck, Back & Knee ? Fast-Absorbing Herbal Formula",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 349,
    "stock": 999,
    "description": "Infused withAmino Glucose, Hyaluronic Acid, Eucalyptus Extract, and Chondroitin Sulfate, this fast-absorbing gel targets pain at its source while nourishing the skin. Ideal forathletes, gym users, and anyone with daily body aches, it provides a cooling sensation that relaxes muscles and promotes faster recovery.\r\n\r\n? Relieves shoulder, neck, back & knee pain\r\n\r\n? Fast-absorbing, non-greasy gel formula\r\n\r\n? Cooling & soothing effect for tired muscles\r\n\r\n? Enriched with Japanese herbal ingredients\r\n\r\n? Perfect for daily body massage and relaxation\r\n\r\nQuality Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-FXLK",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.112Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_3ce6e0ddb714",
    "name": "5PCS Reduce Tar Cigarette Holder | Reusable Tar Filter Smoking Accessory For Cleaner And Smoother Smoking Experience",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 589,
    "stock": 999,
    "description": "Description\r\n5PCS Reduce Tar Cigarette Holder | Reusable Tar Filter Smoking Accessory For Cleaner And Smoother Smoking Experience\r\n\r\nEnjoy A Cleaner And More Comfortable Smoking Experience With The 5PCS Reduce Tar Cigarette Holder. Each Holder Is Expertly Designed To Filter And Reduce Tar, Nicotine, And Harmful Substances Without Affecting The Taste Of Your Cigarette. Made From Durable, Heat-Resistant Material, These Holders Are Lightweight, Easy To Use, And Reusable. Ideal For Everyday Smokers Who Want To Enjoy Their Habit With Less Tar Intake And A Smoother Draw. Compact And Convenient, They Are Perfect For Home, Office, Or Travel Use.\r\n\r\nKey Features:\r\nEffectively Reduces Tar And Nicotine IntakeProvides A Cleaner, Smoother Smoking ExperienceMade From Durable, Heat-Resistant MaterialReusable And Easy To Clean DesignCompact And Portable For Everyday UseMaintains The Original Taste Of CigarettesComes In A Pack Of 5 For Long-Term UseIdeal For Smokers Seeking A Healthier Opt",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-4J8V",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.120Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_8fba13818517",
    "name": "SUNISA Waterproof Mushroom Head Air Cushion Foundation ? BB & CC Cream With Moisturizing Liquid Base And Sponge Applicator",
    "category": "Health & Beauty",
    "subcategory": "Makeup",
    "price": 749,
    "stock": 999,
    "description": "SUNISA Waterproof Mushroom Head Air Cushion Foundation ? BB & CC Cream with Moisturizing Liquid Base and Sponge Applicator\r\nDescription:\r\nAchieve flawless, long-lasting coverage with the SUNISA Waterproof Mushroom Head Air Cushion Foundation. This innovative BB & CC cream formula combines a moisturizing liquid base with a unique mushroom sponge applicator for smooth, even application. The lightweight, breathable texture blends seamlessly into the skin, delivering a natural, radiant finish that lasts all day.\r\n\r\nPerfect for all skin types, this foundation provides buildable coverage to conceal blemishes, redness, and uneven tone while hydrating the skin. The waterproof and sweat-proof formula ensures your makeup stays fresh in any weather, while the compact design makes it ideal for on-the-go touch-ups.\r\n\r\nKey Features:\r\nWaterproof, sweat-proof, and long-lasting formulaMushroom head sponge for effortless blendingMoisturizing liquid base for smooth applicationBB & CC cream benefits in one productSuitable for all skin types and tonesCompact and portable for travel or daily use",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-OZWM",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.151Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_5951c3269f7d",
    "name": "Silicone Heel Protector Sleeve for Cracked Heels & Pain Relief ? Breathable & Cushioned Support",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 259,
    "stock": 999,
    "description": "Say goodbye to dry, cracked heels and painful pressure points with our Silicone Heel Protector Sleeve?a must-have for anyone seeking foot care comfort. Crafted from high-quality, skin-friendly silicone, this sleeve gently wraps around your heel and ankle, offering targeted cushioning and support.\r\n\r\nIts ventilated design features multiple small holes to promote airflow, keeping your feet cool and dry throughout the day. Whether you're on your feet at work, recovering from plantar fasciitis, or simply looking to pamper your feet, this sleeve helps reduce friction, absorb shock, and prevent skin damage.\r\n\r\nPerfect for use during walking, standing, or even while sleeping, it fits snugly without slipping and is easy to clean and reuse. Ideal for both men and women, this heel protector is your go-to solution for healthier, happier feet.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-0KI6",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.178Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_47940dfa7a6c",
    "name": "360? Rotating Acrylic Makeup Organizer ? Multi-Tier Cosmetic Storage with Diamond-Cut Design",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 2399,
    "stock": 999,
    "description": "Transform your beauty routine with this luxurious 360? Rotating Acrylic Makeup Organizer ? the perfect blend of style and functionality. Crafted from high-quality transparent acrylic, this multi-tiered organizer showcases a stunning diamond-cut design that adds a touch of glamour to any vanity or dressing table.\r\n\r\nWith adjustable compartments and rotating access, it?s designed to hold everything from foundation bottles and lipsticks to skincare jars and makeup brushes. The smart tiered layout ensures maximum visibility and easy reach, while the sturdy construction keeps your products secure and beautifully displayed.\r\n\r\nWhether you're a makeup enthusiast or a professional artist, this organizer is a must-have for keeping your beauty space neat, efficient, and effortlessly chic.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-8EEU",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.208Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_3875e2989fa1",
    "name": "Soft Microfiber Flower Cap Towel for Women ? Quick Dry Hair Wrap with Cute Bow Design, Super Absorbent Shower & Bath Turban for Smooth, Frizz-Free Hair (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 349,
    "stock": 999,
    "description": "Keep your hair dry and stylish after every shower with this Flower Cap Towel. Made from super absorbent and soft microfiber, it quickly dries your hair without causing frizz or damage. The elastic, comfortable fit keeps the towel securely in place, while the adorable bow design adds a cute touch. Perfect for use after bathing, swimming, or during skincare routines. Available in multiple vibrant colors to match your mood!\r\n\r\nFeatures:\r\n\r\nUltra-soft & quick-drying microfiber materialGentle on hair ? reduces breakage and frizzStretchable elastic fit for all head sizesCute bow accent for a fashionable lookIdeal for home, travel, and spa useColor Random",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-MRAD",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.242Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_0f88df67e93d",
    "name": "Hair Drying Towel Cap ? Quick Dry, Soft & Absorbent Turban Wrap for Women | Anti-Frizz Hair Wrap Towel for Bathroom & Salon Use (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 199,
    "stock": 999,
    "description": "Say goodbye to heavy, dripping towels and enjoy effortless hair drying with our Microfiber Hair Drying Towel Cap. Designed with premium-quality microfiber fabric, this towel quickly absorbs excess water from your hair, cutting drying time in half while keeping your strands smooth and frizz-free. Its lightweight, soft, and skin-friendly material makes it perfect for all hair types ? whether long, short, curly, or straight.\r\n\r\nThe convenient button loop design ensures a secure fit, so you can move freely while your hair dries naturally ? no slipping or re-wrapping needed. Ideal for daily use after a shower, gym workout, swimming session, or spa day, this towel helps protect hair from heat damage caused by blow-drying.\r\n\r\nAvailable in multiple soothing colors, the Microfiber Hair Drying Towel Cap combines comfort, functionality, and style ? making it an essential part of your beauty and self-care routine. Easy to wash, quick to dry, and reusable for long-term use.\r\n\r\nColors : Random",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-WE04",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.251Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_9b8ca26973f6",
    "name": "Miss Rose 3 PC Regular Deal Silk Foundation Concealer & Blender",
    "category": "Health & Beauty",
    "subcategory": "Makeup",
    "price": 1020,
    "stock": 999,
    "description": "Description\r\nMiss Rose 3 PC Regular Deal Silk Foundation Concealer 30ml Each & Blender\r\nTransform your makeup routine with the ultimate Miss Rose Cosmetics bundle. Start with the Flawless Primer, creating a smooth canvas for your makeup application. Next, the Flawless Foundation effortlessly blends for a natural finish, ensuring long-lasting coverage. Conceal imperfections with the Miss Rose Concealer, achieving a flawless complexion. Amp up your lashes with the Miss Rose Mascara, adding volume and length for a dramatic look. Complete your eye makeup with precision using the Miss Rose Eyeliner, whether you're going for a subtle wing or a bold cat-eye. Each product is meticulously crafted to enhance your natural beauty while providing professional-quality results. From everyday wear to special occasions, this bundle equips you with everything you need to achieve a stunning makeup look. Elevate your beauty game with Miss Rose cosmetics, and step out with confidence every day.\r\n\r\nBlender Random Color\r\n\r\nBeige 1   Beige 2       Beige 3         Fair           Ivory 6",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-56E0",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.252Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_86f44c0fe3b1",
    "name": "1Pc Chubby Pier Foundation Brush | Flat Cream Makeup Brush For Professional Cosmetic Blending, Contouring, And Smooth Makeup Application",
    "category": "Health & Beauty",
    "subcategory": "Makeup",
    "price": 279,
    "stock": 999,
    "description": "Description\r\n1Pc Chubby Pier Foundation Brush | Flat Cream Makeup Brush For Professional Cosmetic Blending, Contouring, And Smooth Makeup Application\r\n\r\nThe 1Pc Chubby Pier Foundation Brush Is Designed For Effortless And Flawless Makeup Application. Featuring Soft, Dense Bristles And A Flat Shape, This Brush Delivers Smooth, Even Coverage For Creams, Liquids, And Foundations. Its Ergonomic Handle Offers A Comfortable Grip, Allowing Precision And Control During Blending Or Contouring. Perfect For Both Professional Makeup Artists And Daily Users, This Brush Ensures A Natural, Airbrushed Finish Every Time. Durable And Easy To Clean, It?s A Must-Have Tool For Every Makeup Kit.\r\n\r\nKey Features:\r\nFlat, Dense Bristles For Smooth And Even ApplicationIdeal For Cream, Liquid, And Foundation MakeupProvides Flawless, Airbrushed FinishSoft Synthetic Bristles Gentle On SkinErgonomic Handle For Comfortable Grip And ControlSuitable For Professional And Personal UseEasy To Clean And Long-Lasting DesignCompact And Travel-Friendly Makeup Essential",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-TR27",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.253Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_8a4602ebeb57",
    "name": "Homeo Cure Whitening Beauty Cream 20gm ? Fast Brightening Formula For Face And Body, Removes Dark Spots, Pimples, And Uneven Skin Tone",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 399,
    "stock": 999,
    "description": "Description\r\nHomeo Cure Whitening Beauty Cream 20gm ? Fast Brightening Formula For Face And Body, Removes Dark Spots, Pimples, And Uneven Skin Tone\r\n\r\nHomeo Cure Whitening Beauty Cream 20gm Is A Powerful Skin Brightening Formula Designed For Both Face And Body. Enriched With Active Ingredients, It Works Effectively To Reduce Dark Spots, Pimples, Acne Scars, And Pigmentation. The Cream Provides Intense Moisturization While Promoting A Smooth, Radiant Complexion. It Helps Lighten Dark Areas Such As Elbows, Knees, Joints, And Underarms, Giving Your Skin An Even Tone And Healthy Glow. Suitable For Daily Use, This Cream Is Dermatologically Recommended For All Skin Types Seeking Quick And Visible Whitening Results.\r\n\r\nKey Features:\r\n\r\nFast Whitening Results Within 2 DaysRemoves Acne, Pimples, And Dark SpotsBrightens Skin Tone And Restores Natural GlowLightens Dark Areas Like Elbows, Knees, And UnderarmsProvides Deep Moisturization And Soft TextureSuitable For Face And Body UseRecommended By Skin ExpertsCompact 20gm Pack For Easy Daily Use",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-95LM",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.254Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_41a6a07f79c4",
    "name": "Reusable Silicone Spa Gel Socks For Dry Feet And Cracked Heel Treatment ? Moisturizing Hydrating Softening And Skin Smoothing Overnight Foot Care",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 599,
    "stock": 999,
    "description": "Description\r\nReusable Silicone Spa Gel Socks For Dry Feet And Cracked Heel Treatment ? Moisturizing Hydrating Softening And Skin Smoothing Overnight Foot Care\r\n\r\nGive Your Feet The Care They Deserve With Reusable Silicone Spa Gel Socks, Specially Designed To Moisturize, Hydrate, And Repair Dry Feet And Cracked Heels. Infused With Soothing Gel Lining, These Socks Lock In Moisture And Enhance Absorption Of Lotions And Creams For Maximum Results. Comfortable To Wear Overnight, They Work Gently While You Sleep To Restore Softness, Smoothness, And Healthy Skin. Ideal For Home Spa Treatments, Self Care Routines, And Everyday Use, These Durable And Washable Socks Are A Practical And Effective Solution For Long Lasting Foot Care.\r\n\r\nKey Features:\r\n\r\nReusable Silicone Spa Gel Socks For Foot CareMoisturizes And Softens Dry Feet And Cracked HeelsHydrating Gel Lining Enhances Lotion AbsorptionProvides Overnight Therapy For Smooth SkinComfortable And Easy To Wear At HomeWashable And Durable For Repeated UseIdeal For Daily Self Care And Home Spa TreatmentsRestores Skin Balance And Improves Foot Health",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-Y8J8",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.263Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_e2bad5b08026",
    "name": "Gluta White Sunblock ? Whitening & UV Protection Sunscreen For All Skin Types",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 379,
    "stock": 999,
    "description": "Gluta White Sunblock ? Whitening & UV Protection Sunscreen For All Skin Types\r\n\r\n\r\nProtect and brighten your skin withGluta White Sunblock, a powerful sunscreen that combines whitening care with effective UV protection. Its lightweight, non-greasy formula absorbs quickly, leaving your skin smooth, radiant, and shielded from harmful sun rays. Perfect for daily use, this sunblock not only prevents tanning and sun damage but also helps maintain an even skin tone. Suitable for men and women of all skin types.\r\n\r\nKey Features:\r\n\r\nBroad-spectrum UV protectionWhitening & brightening formulaLightweight and non-greasy textureHelps prevent tanning and sun damageSuitable for all skin typesIdeal for daily useQuality : COPY",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-H85X",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.303Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_b73ae67e4698",
    "name": "Moroccan Beauty Nila Powder | Blue Nila Skin Whitening Powder 50g | Best Quality Nila Powder",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 249,
    "stock": 999,
    "description": "Product Details:\r\nMix a small amount of the blue powder or blue tansy oil into a carrier oil like jojoba, argan, or sweet almond oil.Apply 2-3 drops to clean, damp skin. Gently massage in circular motions until absorbed.Combine the powder with a natural base like honey, yogurt, or clay.Add a few drops of water or rose water to form a smooth paste.Apply to the face, avoiding the eyes. Leave on for 10-15 minutes before rinsing with lukewarm water.Mix the powder with a little water or aloe vera gel to form a paste.Dab onto blemishes or irritated areas and leave it on overnight.Add a pinch of the powder to your moisturizer, serum, or toner for extra benefits.Always do a patch test to check for sensitivity before full application.Use springly, as the blue pigment is potent and may stain if overused.Store in a cool, dry place to preserve its effectiveness.Anti-Inflammatory: Calms redness, irritation, and inflammation, making it ideal for sensitive or acne-prone skin.Antioxidant-Rich: Protects the skin from environmental damage and free radicals.Hydrating: Helps retain moisture, leaving the skin soft and supple.Balancing: Regulates sebum production, reducing oiliness and breakouts.Healing: Speeds up the recovery of minor blemishes and wounds.\r\nQuality: Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-47SD",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.308Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_77e6d8e0d742",
    "name": "Liru Professional Care Vitamin C+E Antioxidant Serum 30 ML",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 349,
    "stock": 999,
    "description": "Description\r\nLiru Professional Care Vitamin C+E Antioxidant Serum 30 ML\r\n\r\nVitamin E + C Serum with Collagen Vitamin C is a powerful antioxidant that stimulates collagen production in your skin. It also fights fine lines and brightens your complexion, leaving skin with a brighter appearance. It also removes pigmentation for a more even skin tone. Skin care experts also describe it as one of the best anti-aging ingredients you can use. Vitamin E is well known for its benefits on skin health and appearance. It can be applied topically to your face to reduce inflammation and make your skin look younger. -Brand:Liru -Professional Skin care -Vitamin C+E -20% Antioxidant serum -Collagen -Multifunction essence\r\n\r\nNet Quantity: 30ml\r\n\r\nQuality Copy : Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-QNMP",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.312Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_07243f68cac1",
    "name": "Garnier Skin Naturals Vitamin C Booster Serum 30ml ? Bright Complete 30x Vitamin C Formula For Glowing, Spot-Free, And Radiant Skin",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 379,
    "stock": 999,
    "description": "Description\r\nGarnier Skin Naturals Vitamin C Booster Serum 30ml ? Bright Complete 30x Vitamin C Formula For Glowing, Spot-Free, And Radiant Skin\r\n\r\nGarnier Skin Naturals Bright Complete Vitamin C Booster Serum 30ml Is A Powerful Brightening Formula Infused With 30x Concentrated Vitamin C. It Works Effectively To Reduce Dark Spots, Dullness, And Pigmentation, Giving You Clear, Radiant, And Glowing Skin. The Lightweight And Fast-Absorbing Texture Penetrates Deep Into The Skin, Delivering Instant Freshness And A Natural Glow. Suitable For All Skin Types, This Serum Boosts Skin Brightness While Reducing Visible Spots In Just 3 Days Of Regular Use. Perfect For Daily Skincare Routines, It Helps Achieve Smooth, Youthful, And Luminous Skin.\r\n\r\nKey Features:\r\n\r\nEnriched With 30x Concentrated Vitamin C For Bright, Clear SkinReduces Dark Spots, Pigmentation, And DullnessVisible Brighter Results In Just 3 DaysLightweight, Non-Sticky, And Fast Absorbing FormulaEvens Out Skin Tone And Boosts Natural GlowSuitable For All Skin Types, Including Sensitive SkinDermatologically Tested And Safe For Daily Use30ml Bottle Ideal For Long-Lasting UseQuality Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-OF0H",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.313Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_b750fa6938e4",
    "name": "Yardlie Apple Hair Color Shampoo ? 2-in-1 Color & Cleanse Formula (400ml Dark Brown )",
    "category": "Health & Beauty",
    "subcategory": "Hair_Care",
    "price": 1899,
    "stock": 999,
    "description": "Description\r\nYardlie Apple Hair Color Shampoo Price In Pakistan is an innovative 3-in-1 formula that combines the power of hair coloring, shampooing, and conditioning in one easy step. Designed for those who want quick, natural-looking color with the added benefits of apple extract and herbal nourishment, this shampoo is ideal for both men and women.\r\n\r\nWhat Is Yardlie Apple Hair Color Shampoo?Yardlie Apple Hair Color Shampoo is a convenient, no-mess hair dye solution that lets you color your hair at home without the hassle of traditional dyes. Enriched with natural apple extract, it gently colors your hair while also cleansing and moisturizing the scalp, leaving it soft, shiny, and vibrant in just 10?15 minutes.\r\n\r\nBenefits Of Yardlie Apple Hair Color Shampoo\r\nColors Hair Instantly ? Natural-looking black or brown shades in minutesInfused with Apple Extract ? Nourishes scalp and strengthens roots3-in-1 Formula ? Acts as color, shampoo, and conditionerGentle on Scalp ? No ammonia, no parabens, no harsh chemicalsShiny & Silky Finish ? Leaves hair soft, smooth, and manageableQuick & Easy Application ? Perfect for busy lifestylesCovers Grey Hair ? Effectively blends away grey.Colors - Natural Black & Dark Brown",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-MAF5",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.320Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_601d7b28404c",
    "name": "Wiki Special Anti Acne Serum ? 30ml | Clears Acne, Soothes Skin & Fights Blemishes",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 449,
    "stock": 999,
    "description": "Description\r\n\r\nWiki Special Anti Acne Serum ? 30ml | Clears Acne, Soothes Skin & Fights Blemishes\r\n\r\nSay goodbye to stubborn breakouts withWiki Special Anti Acne Serum? your daily defense against acne, blemishes, and clogged pores. Formulated to target acne at the root, this lightweight serum penetrates deeply to purify pores, reduce inflammation, and restore skin clarity.\r\n\r\nPerfect for oily and acne-prone skin, this dermatologist-recommended solution helps fade acne marks and balances skin tone for a smoother, more radiant complexion.\r\n\r\n\r\n\r\nKey Features:\r\nAnti-Acne Formula: Effectively fights breakouts, pimples, and blemishes.Lightweight & Fast Absorbing: Non-greasy formula ideal for daily use.Soothing & Calming: Helps reduce redness, irritation, and swelling.Daily Skincare Routine: Use day and night after cleansing.Dermatologist Tested: Gentle on sensitive, acne-prone skin.Net Weight: 30mlQuality : Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-FV19",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.343Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_5acfad9a13a7",
    "name": "Wiki Special Skin Care Cream 30g ? Brightening And Deep Cleansing Formula For Radiant, Glowing, And Even Skin Tone For All Skin Types",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 349,
    "stock": 999,
    "description": "Description\r\nWiki Special Skin Care Cream 30g ? Brightening And Deep Cleansing Formula For Radiant, Glowing, And Even Skin Tone For All Skin Types\r\n\r\nWiki Special Skin Care Cream 30g Brightens Complexion, Deeply Cleanses Pores, And Promotes A Radiant Glow. Suitable For All Skin Types With A Gentle, Effective Formula.\r\n\r\nWiki Special Skin Care Cream 30g Is A Premium Brightening Formula Designed To Enhance Your Natural Glow And Provide Deep Cleansing For Healthier Skin. It Gently Exfoliates Dead Skin Cells, Reduces Dullness, And Reveals A Smoother, More Radiant Complexion. Suitable For All Skin Types, This Cream Helps Even Out Skin Tone While Improving Texture And Clarity. Regular Use Promotes A Luminous Glow, Making Your Skin Look Fresh, Clear, And Youthful. Perfect For Daily Use, Wiki Special Skin Care Cream Adds A Touch Of Brightness And Confidence To Your Beauty Routine.\r\n\r\nKey Features:\r\n\r\nBrightens Skin Instantly For A Radiant GlowGently Exfoliates Dead Skin Cells And ImpuritiesDeeply Cleanses Pores For Clearer ComplexionEvens Out Skin Tone And Improves TextureSuitable For All Skin Types, Including Sensitive SkinPromotes Smooth, Soft, And Healthy-Looking SkinLightweight, Non-Greasy, And Easy To ApplyIdeal For Daily Use To Maintain Natural GlowCompact 30g Pack Perfect For Travel And Everyday UsQuality Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-D6AL",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.358Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_1678828214e6",
    "name": "Botox Bee Venom Whitening & Moisturizing Cream ? Anti-Aging, Brightening & Skin Firming Facial Care (100g)",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 329,
    "stock": 999,
    "description": "Description\r\nBotox Bee Venom Whitening & Moisturizing Cream ? Anti-Aging, Brightening & Skin Firming Facial Care (100g)\r\n\r\n\r\n\r\nWhitening & Moisturizing Botox Bee Venom Face Cream ? Brightening, Anti-Aging, Hydrating Moisturizer for Radiant, Smooth & Youthful Skin. Experience the power of nature with the Whitening & Moisturizing Botox Bee Venom Facial Care Cream. Infused with pure bee venom extract, this premium cream is designed to rejuvenate, brighten, and deeply hydrate your skin. Bee venom helps stimulate collagen production, smooth fine lines, and improve elasticity, while advanced whitening agents promote an even and radiant complexion. The lightweight, fast-absorbing formula provides intense hydration without greasiness, leaving skin soft, supple, and visibly youthful. Suitable for all skin types, this cream is perfect for your daily skincare routine to achieve a naturally glowing and youthful look.\r\n\r\nKey Features:\r\n\r\nProduct Type: Whitening & Moisturizing Facial CreamEnriched with pure bee venom extract for rejuvenationBrightens and evens skin tone for a radiant glowDeeply hydrates and locks in moistureHelps smooth fine lines and wrinklesImproves skin firmness and elasticityLightweight, non-greasy, and fast-absorbing formulaSuitable for all skin typesWeight: (100g)Quality CopyPackage Includes: 1 x Bee Venom Facial Care Cream (100g)",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-LU6L",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.364Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_448d7bd6e786",
    "name": "Fivfivgo Vitigo Bee Venom Correcting Cream 20g | Skin Tone Balancing And Pigmentation Repair Cream For Even, Healthy-Looking Skin",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 370,
    "stock": 999,
    "description": "Fivfivgo Vitigo Bee Venom Correcting Cream 20g | Skin Tone Balancing And Pigmentation Repair Cream For Even, Healthy-Looking Skin\r\n\r\nFivfivgo Vitigo Bee Venom Correcting Cream 20g Is Expertly Formulated To Restore Skin Balance And Enhance Natural Radiance. Infused With Bee Venom Extract, This Correcting Cream Helps Improve The Appearance Of Uneven Skin Tone And Discoloration Caused By Conditions Like Vitiligo. Its Nourishing Ingredients Support Skin Regeneration, Promote Pigment Balance, And Improve Texture, Leaving The Skin Smoother, Brighter, And Healthier. The Lightweight, Fast-Absorbing Formula Is Gentle Enough For Daily Use On Targeted Areas, Making It Suitable For All Skin Types Seeking Visible Skin Tone Improvement.\r\n\r\nKey Features:\r\n\r\nEnriched With Natural Bee Venom ExtractHelps Improve Uneven Skin Tone And DiscolorationPromotes Skin Regeneration And Pigment BalanceEnhances Skin Texture For A Smoother AppearanceLightweight, Non-Greasy, And Fast AbsorbingGentle Enough For Daily Use On Targeted AreasSuitable For All Skin TypesHelps Restore Confidence With Healthier-Looking SkinQuality Copy",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-BE41",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.366Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_d87f60fde016",
    "name": "4 In 1 Massage Gun | Deep Tissue Percussion Massager With 4 Attachments | Handheld Electric Body Relaxation Therapy For Pain Relief & Recovery (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 2100,
    "stock": 999,
    "description": "Description\r\n4 In 1 Massage Gun | Deep Tissue Percussion Massager With 4 Attachments | Handheld Electric Body Relaxation Therapy For Pain Relief & Recovery\r\n\r\nExperience Ultimate Relaxation With The 4 In 1 Muscle Massage Gun, Designed To Relieve Muscle Tension, Soreness, And Fatigue Effectively. Equipped With Four Interchangeable Massage Heads, This Powerful Percussion Massager Targets Different Muscle Groups, Promoting Blood Circulation And Accelerating Recovery After Exercise Or Long Workdays. Its Ergonomic Design And Adjustable Speed Settings Allow Personalized Comfort, Making It Ideal For Athletes, Fitness Enthusiasts, And Anyone Seeking Daily Stress Relief. Compact, Portable, And Rechargeable, It?s Your Perfect At-Home Massage Companion.\r\n\r\nKey Features:\r\n\r\n4 Interchangeable Massage Heads For Targeted Muscle Relief\r\n\r\nDeep Tissue Percussion Therapy For Pain And Tension Reduction\r\n\r\nPromotes Blood Circulation And Muscle Recovery\r\n\r\nAdjustable Speed Settings For Personalized Comfort\r\n\r\nErgonomic, Lightweight, And Easy-To-Use Design\r\n\r\nRechargeable Battery For Cordless Convenience\r\n\r\nIdeal For Back, Neck, Legs, Shoulders, And Arms\r\n\r\nSuitable For Athletes, Office Workers, And Home Use\r\n\r\nRandom Color",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-LQS2",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.473Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_47c6575622a8",
    "name": "Dr Rashel Vitamin C Brightening And Anti-Aging Day Cream With Niacinamide | Hydrating Face Moisturizer For Glowing Skin ? 50g",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 1100,
    "stock": 999,
    "description": "Description\r\nDr Rashel Vitamin C Brightening And Anti-Aging Day Cream With Niacinamide | Hydrating Face Moisturizer For Glowing Skin ? 50g\r\n\r\nDr Rashel Vitamin C Brightening And Anti-Aging Day Cream Is A Luxurious Skincare Essential That Combines The Power Of Vitamin C And Niacinamide To Revitalize Your Skin. This Lightweight, Fast-Absorbing Formula Helps Brighten Dull Skin, Fade Dark Spots, And Reduce Fine Lines For A Healthy, Youthful Glow. Enriched With Powerful Antioxidants, It Protects Against Environmental Damage While Keeping Your Skin Deeply Hydrated And Smooth. Ideal For Daily Use, This Cream Works Perfectly Under Makeup And Leaves The Skin Fresh, Soft, And Luminous.\r\n\r\nKey Features:\r\n\r\nInfused With Vitamin C And Niacinamide For Skin Brightening\r\n\r\nReduces Fine Lines, Wrinkles, And Dark Spots\r\n\r\nDeeply Moisturizes And Hydrates The Skin\r\n\r\nPromotes Even Skin Tone And Natural Glow\r\n\r\nLightweight, Non-Greasy Formula Perfect For Daily Use\r\n\r\nProvides Antioxidant Protection Against Free Radicals\r\n\r\nSuitable For All Skin Types\r\n\r\nNet Weight: 50 Grams\r\n\r\nQuality Original",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-T26G",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.503Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_f49d4394f125",
    "name": "Originals 'Legacy' Eau de Parfum for Men | Bold, Long-Lasting EDP Rollerball Fragrance for Him.",
    "category": "Health & Beauty",
    "subcategory": "Fragrances",
    "price": 375,
    "stock": 999,
    "description": "Originals 'Legacy' Eau de Parfum for Men\r\n\r\nLeave your mark with Originals 'Legacy', a distinguished and powerful fragrance crafted for the modern man who commands respect and leaves a lasting impression. This Eau de Parfum embodies strength, sophistication, and timeless appeal.\r\n\r\n\r\n\r\nKey Features\r\n\r\n\r\nExceptional EDP Concentration: As a high-quality Eau de Parfum (EDP), 'Legacy' features a rich concentration of aromatic oils, ensuring a deep, long-lasting scent that projects confidence throughout your day.Masculine & Refined Scent: 'Legacy' is designed to be a bold and memorable masculine fragrance. Expect a sophisticated blend of notes that might include rich woods, fresh spices, crisp citrus, or warm amber, creating an aroma that is both commanding and alluring.Convenient Rollerball Design: Housed in a sleek bottle with a silver-tone rollerball applicator, this fragrance allows for precise and controlled application. It?s perfectly sized for your grooming kit, gym bag, or office drawer for a quick refresh anytime.\r\nApply to pulse points such as the wrists, neck, and behind the ears to unleash the enduring essence of 'Legacy' and make your presence felt.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-UNW1",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.528Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_283c5903345a",
    "name": "6 Wheel Pressure Point Neck Massager Relieve Neck, Back And Shoulder Pain (Random Color)",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 750,
    "stock": 999,
    "description": "The 6-Roller Pressure Point Full Body Massager is a unique handheld manual massager that allows full control of pressure to target specific pain areas in the body. You can decide for yourself how hard or soft of a massage you would like to apply for the affected area!",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-SP2M",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.672Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_71db7e38178d",
    "name": "Body Posture Corrector Belt Adjustable Shoulder And Back Support Brace For Men And Women | Relieves Pain, Aligns Spine, And Improves Posture",
    "category": "Health & Beauty",
    "subcategory": "Health_Supplements",
    "price": 1260,
    "stock": 999,
    "description": "Body Posture Corrector Belt Adjustable Shoulder And Back Support Brace For Men And Women | Relieves Pain, Aligns Spine, And Improves Posture\r\n\r\nEnhance Your Confidence And Comfort With The Body Posture Corrector Belt, Designed To Support Your Back And Shoulders For Proper Alignment. This Adjustable Brace Helps Relieve Pain, Reduce Muscle Fatigue, And Improve Overall Posture By Gently Aligning The Spine. Perfect For Men And Women, It Is Made From Soft, Breathable Material That Ensures Comfort During Daily Activities. Whether You?re Working, Exercising, Or Relaxing, This Supportive Belt Encourages Better Posture And Long-Term Spinal Health.\r\n\r\nKey Features:\r\n\r\nAdjustable Design For A Customized And Comfortable Fit\r\n\r\nSupports Back And Shoulders To Correct Poor Posture\r\n\r\nHelps Relieve Neck, Shoulder, And Back Pain\r\n\r\nMade From Soft, Breathable, And Skin-Friendly Material\r\n\r\nLightweight And Discreet Under Clothing\r\n\r\nPromotes Spinal Alignment And Confidence\r\n\r\nIdeal For Daily Use At Work, Home, Or During Exercise\r\n\r\nSuitable For Both Men And Women",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-EPJ6",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.804Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_cfa191272f8d",
    "name": "pack of 12 Zoeva makeup brushes with pouch complete makeup brush set including 12 face and eye make up brushes",
    "category": "Health & Beauty",
    "subcategory": "Makeup",
    "price": 1299,
    "stock": 999,
    "description": "pack of 12 zoeva make up brushses\r\nFLAWLESS FINISH COMPLETE: Inspired by the dazzling fusion of copper and gold, our ZOEVA Complete SetTREAT YOURSELF: The enchanting composition of 12 luxurious, handcrafted brushes made of rose golden ferrules and matte brown handles comes stowed in an elegant dark brown brush clutch and is a statement accessory on every beauty lover?s vanity. Dressed with the finest natural and synthetic hair, the brushes are ideal for daily makeup routines as well as bold looks.MAKEUP TIP: This complete makeup set is a great addition to your collection! Brushes included come in all shapes and sizes to add some extra flare and style to your makeup technique. Everything from eyeshadow brushes, to highlight and even precise contour, this set is great to make sure you have all the right tools for every makeup occasion.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-5T94",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.806Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_625950c8f2e8",
    "name": "360? Rotating Makeup Brush Organizer | Elegant Makeup Brush Holder with Clear Dome Cover ? Dustproof Cosmetic Organizer",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 920,
    "stock": 999,
    "description": "Upgrade your vanity with this sleek and functional Makeup Brush Holder with Transparent Dome Cover. Designed to combine elegance with practicality, this organizer keeps your makeup essentials clean, visible, and within easy reach. The clear dome lid protects your brushes and tools from dust while adding a modern touch to your space.\r\n\r\nCrafted with a sturdy white base and a crystal-clear cover, the cylindrical design fits seamlessly into any d?cor. Whether you're storing brushes, lipsticks, eyeliners, or other cosmetics, this holder keeps everything upright and organized. The compact size makes it ideal for small spaces, while the easy-lift lid ensures quick access during your beauty routine.\r\n\r\nKey Features:\r\n\r\nTransparent dome cover for dust protectionCompact and stylish designIdeal for brushes, lipsticks, and small toolsEasy to clean and maintainPerfect for vanity tables, bathrooms, or travel setups360 degree movable\r\nAdd a touch of elegance to your daily routine with this premium makeup brush holder?where beauty meets organization.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-AAEL",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.816Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_bb26998aee5a",
    "name": "Cnaier 4 in 1 Electric Cleanser | Facial Cleansing Brush & Massager - Face Brush Set | Electric Rotating Face Scrubber for Deep Cleaning, Exfoliating, Blackhead Removing AE-8286",
    "category": "Health & Beauty",
    "subcategory": "Personal_Care",
    "price": 3199,
    "stock": 999,
    "description": "Two cleaning speeds. High speed: normal skin or skin with thick stratum corneum. Low speed: sensitive skin.2. With IP65 waterproof design, don't worry about using it in the bathroom or shower.3. Use USB to charge.4. Sponge brush head: easily remove oil and dirt on the skin surface5. Ultra-fine soft brush head: exfoliates dead skin cells6. Massage brush head: reduce edema, improve fine lines and increase skin elasticityPackage:Electric cleansing brush x1Sponge brush head x1Superfine soft brush head x2MULTI-FUNCTION BRUSH HEAD: This facial cleaning machine uses 3D sonic motion to deepen the cleansing and better promote collagen production. Equipped with 4 brush head: 1 sponge pad to easily remove dirt and dirt on the surface; 2 ultra-fine soft facial brushes for replacement and full exfoliation, remove grease and dead skin; 1 acupressure massage rolling head to lose weight, reduce edema and Wrinkles, increase skin elasticity, greatly contribute to the nutritional absorption of beauty cream.? EXTRA CLEAN SKIN: This NEWEST 3D sonic electric cleansing brush uses the most advanced and innovative ion cleaning technology. It effectively exfoliates, cleans and removes dead cells, blackheads, acne and dust particles in clogged pores. In addition, it can increase?Massage brush head x1USB charging cable x1Cleansing brush base x1Rechargeable",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-8NAA",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.830Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_4125e53cebf6",
    "name": "BIOAQUA Brightening & Exfoliating Rice Gel Face Scrub 140g",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 680,
    "stock": 999,
    "description": "BIOAQUA Brightening & Exfoliating Rice Gel Face Scrub 140g\r\nExfoliating mildly skin is watery&smoothRemove cutin, skin is watery&smoothContains rice botanical ingredients, clean & nourish skin, and make skin tender.Balance water according to skin state, keep the best skin state all day. Protect skinNourish the skin, and add the required water.Moisturizing, moisturizing the skin smooth.Net Weight: 140g\r\nHow to use Bio Aqua rice gel?\r\nCleanse your face with a gentle cleanser.Apply a small amount of rice gel to damp skin.Gently massage the gel onto your face using circular motions for about one minute.Rinse off with lukewarm water.Follow with your regular skincare routine, such as toner and moisturizer.Use 1-2 times per week for best results\r\n[video width=&quot;848&quot; height=&quot;480&quot;",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-Q4K0",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.855Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_ff5d58795e26",
    "name": "Gluta White Night Cream ? Advanced Skin Brightening, Nourishing & Anti-Aging Formula (50ml)",
    "category": "Health & Beauty",
    "subcategory": "Skincare",
    "price": 390,
    "stock": 999,
    "description": "Gluta White Night Cream (50ml) is a high-quality skin care solution designed for those seeking brighter, healthier, and more radiant skin. Expertly formulated with potent antioxidants and glutathione, this night cream delivers advanced nourishment and revitalization while you sleep. It effectively targets dark spots, uneven skin tone, and signs of aging, supporting a clearer and youthful complexion. Suitable for all skin types, Gluta White Night Cream hydrates deeply, boosts skin?s natural glow, and helps repair daily damage for a luminous morning finish. Whether you want to reduce hyperpigmentation or enhance your skin?s vitality, this premium copy formula is your night-time essential.\r\n\r\nKey Features\r\n\r\nQuantity: 50mlBrightens and evens skin tone while you sleep.Enriched with antioxidants and glutathione for advanced skin nourishment.Effective against signs of aging, dark spots, and pigmentation.Deeply hydrates and supports skin repair overnight.Suitable for all skin types.Promotes glowing, healthy, and youthful-looking skin with regular use.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "HEA-PMFC",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.856Z",
    "site": "https://magicearn.shop"
  }
]