[
  {
    "id": "prod_6d8e8960763c",
    "name": "M28 TWS Bluetooth Earphone Wireless Headphones Earbuds Blutooth Handfree Headsets With Charging Box/M28 Bluetooth Earbuds 5.3 Gaming Earbuds",
    "category": "Mobile & Tablets",
    "subcategory": "Mobile_Accessories",
    "price": 1500,
    "stock": 999,
    "description": "M28 Wireless Earphones Bluetooth Headphones TWS\r\nStereo Touch Control Noise Reduction Waterproof\r\nEarbuds Headsets With Microphone\r\n2000 mah battery\r\nBest for music and games\r\nHigh quality available\r\ncharging time:about 2 hours\r\nstandby:280hours\r\ninput:5v=1A\r\nOutput:5v=1A",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-QA50",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.479Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_6ae7f592affd",
    "name": "12-Inch Mobile Screen Magnifier ? HD Phone Display Amplifier for Movies & Gaming",
    "category": "Mobile & Tablets",
    "subcategory": "Mobile_Accessories",
    "price": 690,
    "stock": 999,
    "description": "Upgrade your mobile viewing experience with this sleek and portable 12-inch smartphone screen magnifier. Perfect for binge-watching, gaming, or reading, this device uses a high-definition curved lens to amplify your phone?s display?giving you a mini-theater feel without the bulk or expense of a tablet.\r\n\r\nCrafted with a foldable stand and lightweight frame, it?s ideal for travel, bedside use, or hands-free entertainment at home. The magnifier is compatible with all smartphones and requires no batteries or software?just place your phone behind the lens and enjoy a larger, clearer image instantly.\r\n\r\nWhether you're watching action-packed videos, reading eBooks, or video chatting with loved ones, this screen amplifier reduces eye strain and enhances clarity. A smart, low-tech solution for high-impact viewing.Upgrade your mobile viewing experience with this sleek and portable 12-inch smartphone screen magnifier. Perfect for binge-watching, gaming, or reading, this device uses a high-definition curved lens to amplify your phone?s display?giving you a mini-theater feel without the bulk or expense of a tablet.\r\n\r\nCrafted with a foldable stand and lightweight frame, it?s ideal for travel, bedside use, or hands-free entertainment at home. The magnifier is compatible with all smartphones and requires no batteries or software?just place your phone behind the lens and enjoy a larger, clearer image instantly.\r\n\r\nWhether you're watching action-packed videos, reading eBooks, or video chatting with loved ones, this screen amplifier reduces eye strain and enhances clarity. A smart, low-tech solution for high-impact viewing.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-XLY4",
    "status": "active",
    "last_updated": "2025-10-24T09:38:36.821Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_d150b2b1fff6",
    "name": "Bolt Power Bank B102 High-Capacity Portable Charger Designed To Keep Your Devices Powered Up On The Go 10'000mAh Battery",
    "category": "Mobile & Tablets",
    "subcategory": "Mobile_Accessories",
    "price": 2899,
    "stock": 999,
    "description": "Description\r\nThe Bolt Power Bank B102 is a high-capacity portable charger designed to keep your devices powered up on the go. With its robust 10,000mAh battery, you can charge your smartphones, tablets, and other gadgets multiple times without worrying about running out of power.\r\n\r\nKey Features:\r\n- Multiple Charging Options: Comes with 4 attached charging cables, including USB-C, Lightning, and Micro USB, making it compatible with a wide range of devices.\r\n\r\n- Fast Charging: Supports 12W fast charging output, allowing you to quickly top up your devices.\r\n\r\n- LED Indicator: Displays the remaining battery life, so you always know when it's time to recharge.\r\n\r\n- Safety Features: Includes overcharge protection, short circuit prevention, and temperature control to ensure safe and reliable charging.\r\n\r\n- Compact Design: Lightweight and compact body makes it easy to carry in your bag or pocket.\r\n\r\nSpecifications:\r\n\r\n- Capacity: 10,000mAh\r\n\r\n- Input: Micro USB (DC 5V/2.0A) and Type-C (DC 5V/2.0A)\r\n\r\n- Output: 2 USB ports (5V/2.4A, 12W Max each) and 1 Type-C port\r\n\r\n- Weight: Not specified, but designed to be compact and lightweight\r\n\r\nOverall, the Bolt Power Bank B102 is a reliable and versatile portable charger that's perfect for daily use, travel, or emergencies",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-EKXD",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.148Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_2fc560969f54",
    "name": "InTouch INT-W03 Wireless Bluetooth Earbuds ? ANC + ENC, Long Battery Life, High-Quality Sound, Perfect for PUBG Gaming",
    "category": "Mobile & Tablets",
    "subcategory": "Mobile_Accessories",
    "price": 3299,
    "stock": 999,
    "description": "InTouch INT-W03 Wireless Bluetooth Earbuds ? Premium Sound, Long Battery Life & Gaming-Ready Performance\r\nExperience audio like never before with the InTouch INT-W03, the latest model in InTouch?s cutting-edge Bluetooth earbud lineup. Designed for music lovers, gamers, and everyday users alike, these earbuds combine sleek aesthetics with powerful features to deliver an immersive listening experience.\r\n\r\n? Crystal-Clear Sound Quality Powered by advanced audio drivers and tuned for precision, the INT-W03 delivers rich bass, crisp mids, and clear highs. Whether you're streaming music, watching videos, or gaming, every sound comes through with stunning clarity.\r\n\r\n? Dual Noise Cancellation: ANC + ENC Block out distractions with Active Noise Cancellation (ANC) and Environmental Noise Cancellation (ENC). ANC filters out ambient noise for a focused listening experience, while ENC ensures your voice comes through clearly during calls?even in noisy environments.\r\n\r\n? Extended Battery Life Enjoy up to 16+ hours of playtime on a single charge. The compact charging case provides multiple recharges, keeping your earbuds powered throughout the day. Ideal for travel, work, and long gaming sessions.\r\n\r\n? Optimized for Gaming ? PUBG Ready Low-latency Bluetooth connectivity ensures seamless audio sync, making these earbuds perfect for mobile gaming. Hear every footstep, gunshot, and in-game cue with precision?giving you the competitive edge in titles like PUBG and more.\r\n\r\n? Bluetooth Dragon Chipset Equipped with the latest Bluetooth Dragon technology, the INT-W03 offers fast pairing, stable connections, and energy-efficient performance across all devices.\r\n\r\n? Sleek Design & Premium Finish The glossy black earbuds and metallic charging case exude sophistication. With the InTouch branding and LED indicator on the front, it?s a stylish accessory that complements your tech setup.\r\n\r\nKey Features:\r\n\r\nModel: INT-W03Brand: InTouchANC + ENC Dual Noise CancellationBluetooth Dragon Chipset16+ Hours Battery LifeErgonomic Design for ComfortLED Indicator LightIdeal for Music, Calls, and GamingWater Resistant\r\nUpgrade your audio experience with the InTouch INT-W03 ? where style meets performance. Add it to your cart today and enjoy sound the way it was meant to be heard.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-MMM6",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.264Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_3a8631b002b2",
    "name": "A9 Pro Touch Screen AirPods Pro with Active Noise Cancellation (ANC) & LCD Display | Bluetooth 5.0 Wireless Earbuds",
    "category": "Mobile & Tablets",
    "subcategory": "Mobile_Accessories",
    "price": 2499,
    "stock": 999,
    "description": "Active Noise Cancellation (ANC): The A9 Pro Touch Screen Airpods Pro features advanced ANC technology to block unwanted noise, ensuring a clear and immersive listening experience. Bluetooth 5.0: Equipped with Bluetooth 5.0, these earbuds provide a stable and fast connection, allowing seamless audio streaming and calls. LCD Display: The innovative LCD on the charging case shows battery levels,\r\n\r\n? Material: Plastic? Color: Black, White? Package Includes: 1 x Airpods? Note: Please ensure to follow the instructions provided in the user manual for proper usage and safety precautions.",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-9F6M",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.433Z",
    "site": "https://magicearn.shop"
  },
  {
    "id": "prod_6191bc7ce66a",
    "name": "A58 Plus 6 in 1 - Smartwatch For Women | Best Quality Smart Watch For Girls | Perfect For Gift | Random Color",
    "category": "Mobile & Tablets",
    "subcategory": "Smart_Watches",
    "price": 2600,
    "stock": 999,
    "description": "Description\r\nA58 Plus 6 in 1 - Smartwatch For Women | Best Quality Smart Watch For Girls | Perfect For Gift | Random Color\r\n\r\nThe A58 Plus 6 in 1 Smartwatch for Women combines fashion, technology, and functionality to create the ultimate smart accessory for modern women. Crafted with a sleek, feminine design, this premium-quality smartwatch offers a wide range of smart features that make your daily life easier and more organized.\r\n\r\nStay on top of your fitness goals with step counting, calorie tracking, heart rate monitoring, and sleep analysis ? all accessible right from your wrist. With its multi-sport modes, you can track workouts and maintain a healthy lifestyle with ease.\r\n\r\nThe A58 Plus doesn?t stop at health ? it also keeps you connected. Receive calls, messages, and social media notifications directly on your smartwatch. Its vibrant display, long-lasting battery, and comfortable strap make it perfect for all-day wear, whether you?re at work, at the gym, or out with friends.\r\n\r\nAvailable in stylish colors and designed to suit every outfit, this smartwatch is also an excellent gift option for girls and women who love technology and style.\r\n\r\nKey Features:\r\n6-in-1 Smartwatch Functionality ? Fitness, health, and smart notifications in one device\r\n\r\nHeart Rate & Sleep Monitoring ? Track your health in real time\r\n\r\nMulti-Sport Modes ? Ideal for running, walking, and workouts\r\n\r\nSmart Notifications ? Stay connected with calls, messages & social apps\r\n\r\nVibrant Display & Touch Control ? Easy to use and visually appealing\r\n\r\nComfortable Design ? Lightweight and stylish for everyday wear\r\n\r\nPerfect Gift Choice ? For birthdays, anniversaries, or fitness lovers",
    "images": [],
    "image_count": 0,
    "valid_image_count": 0,
    "has_images": false,
    "sku": "MOB-4XLN",
    "status": "active",
    "last_updated": "2025-10-24T09:38:37.520Z",
    "site": "https://magicearn.shop"
  }
]